[
  {
    "id": "psychophysiology-1-introduction",
    "title": "Psychophysiology 1 Introduction",
    "sourceFile": "Psychophysiology 1 Introduction.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 1: Introduction Dr. Laurens R. Krol 2023-11-07 0\nPage 3: Psychophysiology Introduction History Definition and scope Sample study 2\nPage 4: Psychophysiology History 3\nPage 5: Psychophysiology: History Mind-body problem 4 Philosophical debate about the relationship between (conscious) experiences and the physical body Monists: No distinction needed; one thing can explain both Dualists: Separate things needed to explain mind and body\nPage 6: Psychophysiology: History Mind-body problem Descartes, R. (1680). Les traitez de l'homme et de la formation du foetus. Amsterdam, the Netherlands: Chez Guillaume le Jeûne. 5 Pineal gland\nPage 7: Psychophysiology: History Four humours, four temperaments Illustration: Thurneysser zum Thurn, L. (1574). Quinta Essentia, (…) . Leipzig, Germany: Steinmann. 6 Phlegm – relaxation Blood – enthusiasm Yellow bile – anger Black bile – sadness Attempt to systematically link (mental) health to physical factors\nPage 8: Psychophysiology: History Focus on the brain Illustration: Seymour, W. (1890). Key to phrenology. Philadelphia, PA, USA: Prof. W. Seymour, & Son. 7 Assumption that mental faculties and personality traits are localised in the brain → Pseudoscience phrenology Controlled lesion studies on animals and humans provided clear evidence against phrenology, and in favour of more serious localisation of brain functions. ?\nPage 9: Psychophysiology: History Psychology and emotions Cannon-Bard theory: Emotions are experienced in the brain first, and subsequently result in physiological changes. “We feel afraid, therefore we start sweating.” James-Lange theory: Emotion is the result of physiological experiences. Different specific patterns of physical bodily activity are interpreted by the brain as different emotions. “We feel afraid, because we are sweating.” 8\nPage 10: Psychophysiology: History Emotions and physiology ,, Moreover, the patient’s pulse and disposition are altered when mention is made of the person he loves, and especially when this occurs suddenly. It is possible in this way to ascertain whom he loves, when he will not reveal it himself. The nature of the cure is this: let several names be pronounced, repeating them many times, and place your finger on the patient's pulse. When it varies by a large fluctuation and then returns to normal, and this is repeated thereafter, and is put to the test many times, then the name of the one he loves will be known. ” – Ibn Sina (1025). The canon of medicine. Mesulam, M.-M., & Perry, J. (1972). The diagnosis of love-sickness: Experimental psychophysiology without the polygraph. Psychophysiology, 9(5), 546–551, as cited by Andreassi, J. (2007). Psychophysiology: Human Behavior and Physiological Response (5th Edition). New York, USA: Psychology Press. 9\nPage 11: Psychophysiology: History Physiological measurement In 1791, Luigi Galvani discovered that frog legs twitched when subjected to electrical current. This led to the frog galvanoscope, a device to detect electricity. With this, electrical currents were also found in human bodies. Illustration: Hogg, J. (1861). Elements of experimental and natural philosophy(p. 502). London, UK: Henry G. Bohn. 10\nPage 12: Psychophysiology: History Physiological measurement Richard Caton used a galvanometer to observe electrical impulses from the surface of living rabbit and monkey brains. “… currents ... were found to be … influenced by stimulation of the ... retina by light.” Caton, R. (1875). The electric currents of the brain. British Medical Journal, 2(765), 278. Photo: “A moving coil galvanometer” by Wellcome Collection is licensed under CC BY 4.0 / Removed background from original 11\nPage 13: Psychophysiology: History Physiological measurement In 1924, Hans Berger performed the first measures on a living human brain. Later measurements revealed first indications that different intensities of mental activity led to visible changes in the recorded curves. Berger, H. (1929). Über das Elektrenkephalogramm des Menschen. Archiv für Psychiatrie und Nervenkrankheiten, 87, 527–570. 12 EEG ECG 10 Hz\nPage 14: Psychophysiology: History The field of psychophysiology In 1960, the Society for Psychophysiological Research was founded “… to foster research on the interrelationships between the physiological and psychological aspects of behavior.” Quote and figure: https://sprweb.org/page/History, retrieved 2020-10-26. 13\nPage 15: Psychophysiology Introduction History Definition and Scope Sample study 14\nPage 16: Psychophysiology Definition and scope 15\nPage 17: Psychophysiology: Definition and scope Related fields • Psychology • Physiology • Anatomy • Biological psychology • Physiological psychology • Psychophysics • Psychophysiology 16\nPage 18: Psychophysiology: Definition and scope Related fields • Psychology studies the human mind and behaviour. • Physiology studies the chemical and physical functioning of living systems. • Anatomy studies the structure of living systems. 17\nPage 19: Psychophysiology: Definition and scope Related fields • Biological psychology aka behavioural neuroscience, studies the biological basis of human behaviour and psychology. • Physiological psychology is essentially the same thing. • Psychophysics studies the sensation and perception of physical stimuli. 18\nPage 20: Psychophysiology: Definition and scope Psychophysiology In psychophysiological research … “… the dependent variable is a physiological measure and the independent variable a ‘behavioral’ one …” Stern (1964) Psychophysiology is … “… the scientific study of social, psychological, and behavioral phenomena as related to and revealed through physiological principles and events in functional organisms.” Cacioppo et al. (2007) Stern, J. A. (1964). Toward a definition of psychophysiology. Psychophysiology, 1(1), 90–91. Cacioppo, J., Tassinary, L. G., & Berntson, G. G. (2007). The handbook of psychophysiology(Third ed., p. 4). New York, NY, USA: Cambridge University Press. 19\nPage 21: Psychophysiology: Definition and scope Psychophysiological inference 20\nPage 22: Psychophysiology: Definition and scope Psychophysiological inference Cacioppo, J., Tassinary, L. G., & Berntson, G. G. (2000). The handbook of psychophysiology(Second ed., p. 12). New York, NY, USA: Cambridge University Press. 21\nPage 23: Psychophysiology: Definition and scope Scope 22 • Cardiac and hemodynamic measures • Electromyographic measures • Electrodermal activity • Electroencephalographic measures • Oculomotor and pupillometric measures • Respiration • Salivary activity • Gastrointestinal activity • Genital activity • …\nPage 24: Psychophysiology: Definition and scope Scope Cacioppo, J., Tassinary, L. G., & Berntson, G. G. (2000). The handbook of psychophysiology(Second ed., p. 5). New York, NY, USA: Cambridge University Press. 23 • Cognitive psychophysiology • Social psychophysiology • Developmental psychophysiology • Clinical psychophysiology • Environmental psychophysiology • Applied psychophysiology • …\nPage 25: Psychophysiology Introduction History Definition and scope Sample study 24\nPage 26: Psychophysiology Sample study Rosenfeld, J. P., Nasman, V. T., Whalen, R., Cantwell, B., & Mazzeri, L. (1987). Late vertex positivity in event-related potentials as a guilty knowledge indicator: A new method of lie detection. International Journal of Neuroscience, 34(1-2), 125–129. 25\nPage 27: Psychophysiology: Sample study Methods Rosenfeld, J. P., Nasman, V. T., Whalen, R., Cantwell, B., & Mazzeri, L. (1987). Late vertex positivity in event-related potentials as a guilty knowledge indicator: A new method of lie detection. International Journal of Neuroscience, 34(1-2), 125–129. 26\nPage 28: Psychophysiology: Sample study Methods Rosenfeld, J. P., Nasman, V. T., Whalen, R., Cantwell, B., & Mazzeri, L. (1987). Late vertex positivity in event-related potentials as a guilty knowledge indicator: A new method of lie detection. International Journal of Neuroscience, 34(1-2), 125–129. 27 CAMERAPEARLS\nPage 29: Psychophysiology: Sample study Results Rosenfeld, J. P., Nasman, V. T., Whalen, R., Cantwell, B., & Mazzeri, L. (1987). Late vertex positivity in event-related potentials as a guilty knowledge indicator: A new method of lie detection. International Journal of Neuroscience, 34(1-2), 125–129. 28\nPage 30: Psychophysiology Introduction Psychophysiology studies the relations between psychological phenomena and physiological processes. These relations are generally non-causal and not one-to-one. Psychophysiology can reveal things that otherwise cannot, or would not, be revealed. 29\nPage 31: * Psychophysiology Part 1: Introduction Dr. Laurens R. Krol krol@b-tu.de 30"
  },
  {
    "id": "psychophysiology-2-1-nervous-system",
    "title": "Psychophysiology 2.1 Nervous System",
    "sourceFile": "Psychophysiology 2.1 Nervous system.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 2.1: Overview of the human nervous system Dr. Laurens R. Krol 2023-11-21 0\nPage 2: Psychophysiology: Nervous system Structural definition The nervous system refers to the collection of neurons and supportive glial cells in the body. The central nervous system (CNS) refers to the brain and spinal cord, contained within the dorsal body cavity. The peripheral nervous system (PNS) refers to (parts of) neurons outside of the brain and spinal cord. Figure: “TE-Nervous system diagram” by The Emirr is licensed under CC BY 3.0 / Changed colours, prolonged spinal cord 1\nPage 3: Psychophysiology: Nervous system Functional definition 2 The nervous system transmits signals between different parts of the body in order to coordinate physical action and process sensory information. Neural activity is not the only communication system in the body: the endocrine system uses hormones for communication. (But is largely controlled by the nervous system.)\nPage 4: Psychophysiology: Nervous system Functional definition 3 • Somatic nervous system Controls interaction with the external environment: • Carries sensory impressions to the CNS • Controls activity of (voluntary) striated muscles • Autonomic nervous system Controls the internal environment: • Controls activity of glands • Controls activity of organs • Controls smooth (involuntary) and cardiac muscles\nPage 5: Psychophysiology: Nervous system Functional definition 4 The autonomic nervous system can be divided into two separate systems. • Sympathetic nervous system Dominant in “fight or flight” situations • Parasympathetic nervous system Dominant in “rest and digest” situations\nPage 6: Psychophysiology: Nervous system Sympathetic and parasympathetic innervation Figures from OpenStax are licensed under CC BY 4.0 5\nPage 7: Psychophysiology: Nervous system Overview 6 Nervous system Central nervous system Brain and spinal cord Peripheral nervous system Everything else Somatic nervous system “External”, sensory and voluntary motor functions Autonomic nervous system “Internal”, involuntary functions Sympathetic nervous system “Fight or flight” Parasympathetic nervous system “Rest and digest” Brain activity Facial expressions Skin conductance Heart rate\nPage 8: Psychophysiology Nervous system The human nervous system can be divided into structurally and functionally separate systems. We have the central, peripheral, somatic, and autonomic nervous systems. The autonomic nervous system furthermore consists of the sympathetic and parasympathetic nervous systems which behave antagonistically between “fight or flight” and “rest and digest”. 7\nPage 9: * Psychophysiology Part 2.1: Overview of the human nervous system Dr. Laurens R. Krol krol@b-tu.de 8"
  },
  {
    "id": "psychophysiology-2-2-neurons",
    "title": "Psychophysiology 2.2 Neurons",
    "sourceFile": "Psychophysiology 2.2 Neurons.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 2.2: Neurons and neuronal signalling Dr. Laurens R. Krol 2023-11-21 0\nPage 2: 0 0.5 1 1.5 2 2.5 3 Total number of neurons 1011 Psychophysiology: Neurons The neuron The neuron is the main functional unit of the nervous system, capable of integrating and transmitting signals. 1 97.5% in the cerebellum; trunk-related? Humans: 8.6 × 1010 (86 milliard)\nPage 3: Psychophysiology: Neurons Types of neurons: Structural Figures by OpenStax are licensed under CC BY 4.0 2\nPage 4: Psychophysiology: Neurons Types of neurons: Functional • Sensory neurons (afferent neurons) are activated by various stimuli, and transmit activity to other neurons. • Interneurons receive signals from, and transmit signals to, other neurons. • Motor neurons (efferent neurons) receive signals from other neurons, and transmit activity to effector organs. 3\nPage 5: Psychophysiology: Nervous system Overview 4 Nervous system Glial cells Support and protection (?) Neurons Signal integration and transmission Sensory / afferent Generate signal by stimulation Interneurons Transmit signal between neurons Motor / efferent Transmit signal to effector organs\nPage 6: Psychophysiology: Neurons Basic neuron histology Neuron figure by Pearson Scott Foreman is in the public domain 5 Cell body (soma) Input zone Dendrite Output zone Axon Axon hillock\nPage 7: Psychophysiology: Neurons The neuron at rest Membrane figure by OpenStax is licensed under CC BY 4.0 / Removed voltmeter 6\nPage 8: Psychophysiology: Neurons The neuron at rest Figure from OpenStax is licensed under CC BY 4.0 7\nPage 9: Psychophysiology: Neurons The neuron at rest 8 The resting potential of neurons is approximately -70 mV. It is maintained by the Na⁺/K⁺ pump (sodium-potassium pump), which actively transports Na⁺ ions outwards, and K⁺ ions inwards. Aside from the Na⁺/K⁺ pump, there are a number of gates in the cell membrane that can open and close under different circumstances. This can change the potential across the membrane.\nPage 10: Psychophysiology: Neurons Ion channels / “gates” Figure from OpenStax is licensed under CC BY 4.0 / Cropped; removed voltmeter, ions, and labels 9\nPage 11: Psychophysiology: Neurons Postsynaptic potentials 10 Dendrite Synapse\nPage 12: Psychophysiology: Neurons: Postsynaptic potentials The synapse Figure from OpenStax is licensed under CC BY 4.0 11\nPage 13: Psychophysiology: Neurons: Postsynaptic potentials Neurotransmitter Figure from OpenStax is licensed under CC BY 4.0 12\nPage 14: Psychophysiology: Neurons Postsynaptic potentials Voltmeter figure from OpenStax is licensed under CC BY 4.0 Potential figure by the author is in the public domain 13\nPage 15: Psychophysiology: Neurons: Postsynaptic potentials Temporal and spatial summation 14 Axon hillock Synapse\nPage 16: Psychophysiology: Neurons: Postsynaptic potentials Temporal summation Figure by the author is in the public domain 15\nPage 17: Psychophysiology: Neurons: Postsynaptic potentials Spatial summation 16 Axon hillock\nPage 18: Psychophysiology: Neurons: Postsynaptic potentials Excitation and inhibition 17 Excitatory post-synaptic potential (EPSP) Inhibitory post-synaptic potential (IPSP)\nPage 19: Psychophysiology: Neurons Signal integration Figure from OpenStax is licensed under CC BY 4.0 18\nPage 20: Psychophysiology: Neurons Signal integration Figure originally by Santiago Ramón y Cajal is in the public domain 19\nPage 21: Psychophysiology: Neurons Action potential 20 Axon Action potential Axon hillock\nPage 22: Psychophysiology: Neurons: Action potential Voltage-gated ion channels Figure from OpenStax is licensed under CC BY 4.0 / Cropped; removed voltmeter, ions, and labels 21\nPage 23: Psychophysiology: Neurons: Action potential Voltage-gated ion channels Voltage-gated ion channels are closed when the membrane potential is near its resting potential (-70 mV). They open when this potential increases to a certain threshold. 22\nPage 24: Psychophysiology: Neurons: Action potential Propagation 23 Channels open Axon hillock above threshold\nPage 25: Psychophysiology: Neurons Action potential Figure by the author is in the public domain 24\nPage 26: Psychophysiology: Neurons Action potential Membrane figure from OpenStax is licensed under CC BY 4.0 / Kept only and repeated membrane 25 + + + + + + + + + + + + + + – – – – – – – – – – – – – – – + + – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – + – – – + + – + + + – – – + +\nPage 27: Psychophysiology: Neurons Action potential Figure from OpenStax is licensed under CC BY 4.0 26\nPage 28: Psychophysiology: Neurons: Action potential Saltatory conduction 27 Myelin sheath Node of Ranvier\nPage 29: Psychophysiology: Neurons: Action potential Saltatory conduction Figure from OpenStax is licensed under CC BY 4.0 28\nPage 30: Psychophysiology: Neurons: Action potential Saltatory conduction “Conduction velocity and myelination” by WillowW is licensed under CC BY 3.0 29\nPage 31: Psychophysiology: Neurons: Action potential Saltatory conduction Photo: Clay Banks on Unsplash 30 Touch Myelinated 3 – 30 m/s Temperature Unmyelinated 0.5 – 2 m/s\nPage 32: Psychophysiology: Neurons Action potential Figure from OpenStax is licensed under CC BY 4.0 / Cropped from original 31\nPage 33: Psychophysiology: Neurons: Action potential Back at the synapse Figure by OpenStax is licensed under CC BY 4.0 32\nPage 34: Psychophysiology: Neurons: Action potential Neuromuscular junction Figure by Doctor Jana is licensed under CC BY 4.0 33\nPage 35: Psychophysiology: Neurons Summary 34 Cell body (soma) Input zone Dendrite Output zone Axon Axon hillock Node of Ranvier Synapse Myelin sheath\nPage 36: * Psychophysiology Part 2.2: Neurons and neuronal transmission Dr. Laurens R. Krol krol@b-tu.de 35"
  },
  {
    "id": "psychophysiology-2-3-cns",
    "title": "Psychophysiology 2.3 Cns",
    "sourceFile": "Psychophysiology 2.3 CNS.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 2.3: The central nervous system Dr. Laurens R. Krol Dr. Marius Klug 2024-04-30 0\nPage 2: Psychophysiology Central nervous system Anatomical terminology Spinal cord Brain 1\nPage 3: Psychophysiology Anatomical terminology 2\nPage 4: Inferior Superior Lateral Proximal Posterior or dorsal Proximal Distal Distal Psychophysiology: CNS Anatomical terminology Figures by OpenStax are licensed under CC BY 4.0 3 Lateral ProximalCaudal Cranial Posterior or dorsal Anterior or ventral Right Left Proximal Distal Distal Sagittal (longitudinal) plane Coronal (frontal) plane Axial (transverse) plane Medial\nPage 5: Psychophysiology: CNS: Terminology Different neuroaxis requires different terms Figure by Pixelsquid is licensed under CC BY 4.0 4\nPage 6: Psychophysiology: CNS: Terminology Some other terms A nerve is a bundle of axons in the PNS. In the CNS, this is called a tract. Similarly, a ganglion is a group of neuron cell bodies in the PNS. In the CNS, this is called a nucleus. Afferent nerves conduct signals towards the CNS. The opposite are efferent nerves. 5\nPage 7: Psychophysiology Spinal cord 6\nPage 8: Psychophysiology: CNS Spine and the spinal cord Illustration from the Sobotta Atlas and Text-book of Human Anatomy (1909) is in the public domain Figure by OpenStax is licensed under CC BY 4.0 / Removed labels from original 7 Left posterolateral view Spinal cord Spinal nerve\nPage 9: Psychophysiology: CNS: Spinal cord Spinal nerves Spinal overview figure by Cancer Research UK is licensed under CC BY-SA 4.0 Spinal cutout figure by ášKebert & umimeto.org is licensed under CC BY-SA 4.0 / Removed labels from original 8 Meninges, containing cerebrospinal fluid White matter Grey matter Posterior root Posterior root ganglion Anterior root Sacral S1 – S5 L1 – L5 T1 – T12 C1 – C8 Coccygeal 1\nPage 10: Psychophysiology: CNS: Spinal cord Spinal cord Figure \"Medulla spinalis - Section - English” y Polarlys is licensed under CC BY 2.5 / Removed labels 9 Posterior root: afferent, sensory nerve fibres (going towards) Posterior horn Anterior horn Anterior root: efferent, motor nerve fibres (going away) Posterior root ganglion: afferent neuron somas Central canal\nPage 11: Psychophysiology: CNS: Spinal cord Spinal cord Spinal nerve figure by Henry Vandyke Carter and vectorized by Mysid is in the public domain Section figure \"Medulla spinalis - Section - English” y Polarlys is licensed under CC BY 2.5 / Removed labels and cropped from original 10 y y y … …\nPage 12: Psychophysiology: CNS: Spinal cord Sympathetic and parasympathetic innervation Figures from OpenStax are licensed under CC BY 4.0 11\nPage 13: Psychophysiology: CNS: Spinal cord Dermatomes Figures by Henry Vandyke Carter and adapted by Mikael Häggström are in the public domain 12 Each spinal nerve can be associated with a specific area on the skin. Each area is served by at least two spinal nerves.\nPage 14: Psychophysiology: CNS: Spinal cord Functional description The spinal cord transports afferent and efferent signals between the CNS and the PNS. It also processes reflexes. 13\nPage 15: Psychophysiology: CNS: Spinal cord Reflexes F “Imgnotraçat arc reflex eng” y MartaAguayo is licensed under CC BY-SA 3.0 14\nPage 16: Psychophysiology Brain 15\nPage 17: Psychophysiology: CNS Brain Figure by OpenStax is licensed under CC BY 4.0 16 Forebrain Hindbrain Midbrain\nPage 18: Psychophysiology: CNS: Brain Brain Figure by OpenStax is licensed under CC BY 4.0 17\nPage 19: Psychophysiology: CNS: Brain Hindbrain The medulla (oblongata) controls autonomic functions like breathing, heartbeat, swallowing, vomiting, and sneezing. The pons also controls some autonomic functions, and interfaces the hindbrain with the midbrain. The cerebellum primarily coordinates (but does not initiate) motor control. Figure by OpenStax is licensed under CC BY 4.0 18 Cerebellum Medulla Pons\nPage 20: Psychophysiology: CNS: Brain Midbrain The substantia nigra is involved in the planning and maintenance of voluntary movements ( ~ k ’ ). The ventral tegmental area primarily contains dopaminergic neurons. These two structures are not always differentiated and have largely overlapping functions. Figure by OpenStax is licensed under CC BY 4.0 19 Substantia nigra VTA\nPage 21: Psychophysiology: CNS: Brain: Midbrain Dopaminergic pathways Figure by Slashme, Patrick J. Lynch, and Fvasconcellos is licensed under CC BY-SA 4.0 20 y y y y y y\nPage 22: Psychophysiology: CNS: Brain Forebrain The thalamus “ y ” y (except olfactory) information. The limbic system is associated with emotion and memory, primarily through the amygdala and the hippocampus, respectively. The hypothalamus is primarily responsible for endocrine regulation. Figure by OpenStax is licensed under CC BY 4.0 / Combined thalamus and limbic system 21 Thalamus Hypothalamus Amygdala Hippocampus\nPage 23: Psychophysiology: CNS: Brain: Forebrain Thalamus and limbic system Figure by OpenStax is licensed under CC BY 4.0 22\nPage 24: Psychophysiology: CNS: Brain: Forebrain Cerebral cortex Figure by OpenStax is licensed under CC BY 4.0 23 Frontal lobe Temporal lobe Parietal lobe Occipital lobe\nPage 25: Psychophysiology: CNS: Brain: Forebrain Cerebral cortex Figure by OpenStax is licensed under CC BY 4.0 24 Sulci Gyri Longitudinal fissure Gy “ ”, “ y ” the cerebral cortex. Deeper sulci are often called fissures.\nPage 26: Psychophysiology: CNS: Brain: Forebrain: Cerebral cortex White and grey matter Figure: Lakhan, S.E., Kirchgessner, A. (2012). Chronic traumatic encephalopathy: the dangers of getting \"dinged\". SpringerPlus 1, 2. doi: 10.1186/2193-1801-1-2. Licensed under CC BY 2.0 25 Corpus callosum\nPage 27: Psychophysiology: CNS: Brain: Forebrain Ventricular system F “Blausen 0896 Ventricles Brain” y BruceBlaus (representing Blausen Medical) is licensed under CC BY 3.0 26\nPage 28: Psychophysiology: CNS: Brain: Forebrain Cerebrospinal fluid F “Blausen 0216 CerebrospinalSystem” y BruceBlaus (representing Blausen Medical) is licensed under CC BY 3.0 Blausen.com staff (2014). \"Medical gallery of Blausen Medical 2014\". WikiJournal of Medicine 1 (2). doi: 10.15347/wjm/2014.010. 27 Produced by cells in all four ventricles. Circulates within the ventricular system and the subarachnoid space surrounding the CNS. Provides mechanical protection (shock absorption, pressure maintenance) and transports nutrients and waste products.\nPage 29: Meninges and the subarachnoid space “Blausen 0110 BrainLayers” y Bruce Blaus is licensed under CC BY 3.0 Blausen.com staff (2014). \"Medical gallery of Blausen Medical 2014\". WikiJournal of Medicine 1(2). 28 Arachnoid Pia mater\nPage 30: Psychophysiology: CNS: Brain: Forebrain: Cerebral cortex Function Illustration: Seymour, W. (1890). Key to phrenology. Philadelphia, PA, USA: Prof. W. Seymour, & Son. 29\nPage 31: Psychophysiology: CNS: Brain: Forebrain: Cerebral cortex Brodmann areas Original figure is in the public domain 30 Korbinian Brodmann (1909) identified 52 numbered areas differing based on cellular size, density, and layering.\nPage 32: Psychophysiology: CNS: Brain: Forebrain: Cerebral cortex Sensory, motor, and association areas Figure by OpenStax is licensed under CC BY 4.0 31\nPage 33: Psychophysiology: CNS: Brain: Forebrain: Cerebral cortex Topographic organization Figure by OpenStax is licensed under CC BY 4.0 32 The motor cortex is organised as a somatotopic map of the body, as is the primary samotosensory cortex. This somatotopic organisation is contralateral.\nPage 34: Psychophysiology: CNS: Brain: Forebrain: Cerebral cortex Retinotopic organisation The visual cortex is organised as a map of the retina. Larsson, J., & Heeger, D. J. (2006). Two retinotopic visual areas in human lateral occipital cortex. Journal of neuroscience, 26(51), 13128- 13142. doi: 10.1523/JNEUROSCI.1657-06.2006. Copyright 2006 Society for Neuroscience. Used with permission. 33\nPage 35: Psychophysiology Central nervous system The spinal cord carries afferent (sensory) and efferent (motor) signals. Through interneurons in its grey matter, it is also responsible for reflexes. The brain is organised in different evolutionary stages and functional areas, including the sensory, motor, and association areas of the cerebral cortex. 34\nPage 36: * Psychophysiology Part 2.3: The central nervous system Dr. Laurens R. Krol krol@b-tu.de 35"
  },
  {
    "id": "psychophysiology-3-measurement",
    "title": "Psychophysiology 3 Measurement",
    "sourceFile": "Psychophysiology 3 Measurement.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 3: Foundations of psychophysiological measurement Dr. Laurens R. Krol Dr. Marius Klug 2024-05-07\nPage 2: Psychophysiology Measuring (electro)physiological parameters Figure “EEG” by Bryan Jones is licensed under CC BY-NC-ND 2.0 1\nPage 3: Psychophysiology: Measurement Biosignals Directly measurable, time-varying parameters that reflect physiological activity in living beings are referred to as biosignals. 2 Biosignals Physiological parameters Derivation\nPage 4: Psychophysiological measurement Contents Electricity Electrodes Digital signals 3\nPage 5: Psychophysiological measurement Electricity 4\nPage 6: Psychophysiology: Measurement Electricity • Current The flow of charged particles through a conductor, measured in ampere (A). • Voltage The potential for current to flow from one place to another, measured in volt (V). • Resistance A substance’s ability to resist the flow of current, measured in ohm (Ω). Impedance is resistance for alternating currents. 5\nPage 7: Ohm’s law: Psychophysiology: Measurement: Electricity Electricity: Water analogy 6 𝑅 = 𝑉 𝐼\nPage 8: Psychophysiology: Measurement: Electricity Electric fields Figures: “VFPt image charge plane horizontal” and “VFPt charges plus minus thumb” by Geek3 are licensed under CC BY-SA 3.0 7\nPage 9: Psychophysiology: Measurement: Electricity Electromagnetism 8 A current produces a magnetic field. A magnetic fields induces a current.\nPage 10: Psychophysiological measurement Electrodes 9\nPage 11: Psychophysiology: Measurement Electrodes 10 Biosignals that are of an electric nature can be measured using electrodes. An electrode is an element of an electronic circuit that connects it to a nonmetallic part – such as the human body.\nPage 12: Psychophysiology: Measurement: Electrodes Types of electrodes Microelectrode: original photo \"pyramidal hippocampal neuron 40x\" by MethoxyRoxy is licensed under CC BY-SA 2.5 / Added electrode Microelectrode array: Wark, H. A. C., Sharma, R., Mathews, K. S., Fernandez, E., Yoo, J., Christensen, B., ... Tathireddy, P. (2013). A new high-density (25 electrodes/mm2) penetrating microelectrode array for recording and stimulating sub-millimeter neuroanatomical structures. Journal of Neural Engineering, 10(4), 045003. doi: 10.1088/1741-2560/10/4/045003. Licensed under CC BY-NC-SA 3.0. Subdermal electrodes: © Natus Medical Incorporated. Surface electrode photo by Paul Anthony Stewart is licensed under CC BY-SA 4.0 11 Microelectrodes Microelectrode arrays Subdermal electrodes Surface electrodes\nPage 13: Psychophysiology: Measurement: Electrodes Choice of electrode 12 The goal is to have the highest possible signal-to-noise ratio. An ideal electrode does not change the properties of the tissue it is connected to, nor does it interfere with the signal it measures. The ideal electrode does not exist. Choose the electrode material and placement based on the biosignal you intend to measure.\nPage 14: Psychophysiology: Measurement: Electrodes Electrode placement Most physiological measurements reflect potential differences. What is needed to record one channel of such biopotentials? 13 Recording electrode Reference electrode Ground electrode\nPage 15: Psychophysiology: Measurement: Electrodes Bipolar and unipolar recording techniques 14 Placement specifics will be discussed for the different psychophysiological modalities. In general, there is: • Bipolar measurement: Each recorded channel reflects the difference between two (different) electrodes. • Unipolar or reference measurement: All recorded channels share the same reference electrode. (Either way, all electrodes do usually share the same ground electrode.)\nPage 16: Bipolar Unipolar Psychophysiology: Measurement: Electrodes Bipolar and unipolar recording techniques 15 Ground Channel 2 Channel 1 Reference Ground Channel 1 Channel 2 Channel 3 Channel 4\nPage 17: Psychophysiology: Measurement: Electrodes: Unipolar The reference electrode in unipolar recordings Recording or “active” electrodes are placed near “electrically active” regions to measure voltage relative to an “electrically neutral” reference electrode. However, there is no “electrically neutral” reference location on the human body. Use a reference location that has a good connection. Use a reference location that is common practice for the experiment you’re conducting. (NB: The term “active electrode” often also refers to electrodes that have their own pre-amplifier built-in) 16\nPage 18: Psychophysiological measurement Digital signals 17\nPage 19: Psychophysiology: Measurement Digitizing the measurement Physiological activity represents a continuous, often very small, analog signal. To record biosignals, they need to be amplified and digitized, turning them into discrete-time signals. Different signals may require different degrees of amplification, and different sampling rates. Figure © Brain Products GmbH 18\nPage 20: Psychophysiology: Measurement: Signal Temporal signal properties Time-amplitude representation 19 t V\nPage 21: Psychophysiology: Measurement: Signal Spectral signal properties Time-varying signals can be very complex. It is sometimes easier to look at them as frequencies. 20 100 ms\nPage 22: Psychophysiology: Measurement: Signal: Spectral properties Mixing frequencies 21 5 Hz 25 Hz 5 + 25 ¼(5) + ¾(25) ¾(5) + ¼(25)\nPage 23: Psychophysiology: Measurement: Signal: Spectral properties Spectral analysis Frequency-amplitude representation 22 105 15 20 Hz 105 15 20 Hz Amp Amp\nPage 24: Psychophysiology: Measurement: Signal: Spectral properties Spectral analysis Real data is more complex! 23 105 15 20 Hz Amp\nPage 25: Psychophysiology: Measurement: Signal: Spectral properties Frequency spectrum One way to analyse data is to look at its power spectrum, representing the power (amplitude) in all the different frequencies contributing to the recorded signal. 24\nPage 26: Psychophysiology: Measurement: Signal Aliasing 25\nPage 27: Psychophysiology: Measurement: Signal Nyquist frequency The Nyquist frequency is one half of the sampling rate. Frequencies higher than this are affected by aliasing. A 10 Hz signal must be sampled at 20 Hz or more. 26\nPage 28: Psychophysiology: Measurement: Signal Separating frequencies As an example, this recorded signal appears to be a mixture of one lower-frequency and one higher-frequency component. How can we separate them? 27 Recorded signal\nPage 29: Psychophysiology: Measurement: Signal: Filter Digital filters: Low-pass example 28 Recorded signal 3 1 3 1 4 2 4 2 5 3 5 3 1.5 2 2 2 2.5 3 3 3 3.5 4 4 4 .5 .5 Filtered signal … … Only the lower-frequency component remains! 0.5(3) + 0.5(1) =\nPage 30: Psychophysiology: Measurement: Signal: Filter Digital filters: High-pass example 29 Recorded signal 3 1 3 1 4 2 4 2 5 3 5 3 1.25 -1 1 -1.25 1.25 -1 1 -1.25 1.25 -1 1Filtered signal … … Only the higher-frequency component remains! -.25 .5 -.25 -1.25 -0.25(3) + 0.5(1) + -0.25(3) =\nPage 31: Psychophysiology: Measurement: Signal: Filter Digital filters 30 Recorded signal 3 1 3 1 4 2 4 2 5 3 5 3 1.25 -1 1 -1.25 1.25 -1 1 -1.25 1.25 -1 1High-pass filtered … …-1.25 1.5 2 2 2 2.5 3 3 3 3.5 4 4 4Low-pass filtered …\nPage 32: Psychophysiology: Measurement: Signal: Filter Digital filters Filters allow components of different frequencies to be isolated (filtered) from a signal. 31 Recorded signal High-pass filtered Low-pass filtered Hz Amp\nPage 33: Psychophysiology: Measurement: Signal: Filter Digital filters Filters and other transformations allow us to investigate the power of specific frequencies. 32 Recorded signal with more high- frequency power High-pass filtered Low-pass filtered Hz Amp\nPage 34: Psychophysiology: Measurement: Signal: Filter Filter design Proper filter design is a field of study in its own right. Different types of filter are used to filter out different parts of the signal. Figure “Bandform template” by SpinningSpark is licensed under CC BY-SA 3.0 / Removed all but the curves and axes, changed colours 33 Low-pass and high-pass filters attenuate all frequencies above or below a certain threshold. Band-pass and band-stop filters attenuate all frequencies within or outside of a given range. Notch filters attenuate a single frequency. Hz Amp\nPage 35: Psychophysiology: Measurement: Signal Digitizing the signal The sampling rate and some filters will need to be configured when recording. This cannot be undone! Further filtering can be done later, depending on the analysis. It is also possible to create bipolar channels from unipolar recordings, or to change the reference electrode. Figure © Brain Products GmbH 34\nPage 36: Psychophysiology: Measurement Every modality is different • Cardiac and hemodynamic measures • Electromyographic measures • Electrodermal activity • Electroencephalographic measures • Oculomotor and pupillometric measures • Respiration • Salivary activity • Gastrointestinal activity • … 35\nPage 37: Psychophysiology Measurement Biosignals are directly measurable, time- varying parameters that reflect physiological activity. Further physiological parameters can be derived from them. Biosignals of an electric nature are measured using various kinds of electrodes placed at various locations. Time-varying signals can also be described using spectral features. Filters can be used to isolate or attenuate different frequencies. 36\nPage 38: * Psychophysiology Part 3: Foundations of psychophysiological measurement Dr. Laurens R. Krol krol@b-tu.de 37"
  },
  {
    "id": "psychophysiology-4-experimental-design",
    "title": "Psychophysiology 4 Experimental Design",
    "sourceFile": "Psychophysiology 4 Experimental design.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 4: Psychophysiological experimentation Dr. Laurens R. Krol Dr. Marius Klug 0\nPage 2: Psychophysiology: Definition and scope Psychophysiology Psychophysiology is … “… the scientific study of social, psychological, and behavioral phenomena as related to and revealed through physiological principles and events in functional organisms.” Cacioppo et al. (2007) In psychophysiological research … “… the dependent variable is a physiological measure and the independent variable a ‘behavioral’ one …” Stern (1964) Stern, J. A. (1964). Toward a definition of psychophysiology. Psychophysiology, 1(1), 90–91. Cacioppo, J., Tassinary, L. G., & Berntson, G. G. (2007). The handbook of psychophysiology (Third ed., p. 4). New York, NY, USA: Cambridge University Press. 1\nPage 3: Psychophysiology Psychophysiological experimentation Basics of experimental design Psychophysiology-specific design issues Additional issues to consider 2\nPage 4: Psychophysiology: Experimentation Basics of experimental design https://hpmor.com/chapter/8 3\nPage 5: Psychophysiology: Experimentation: Basics The scientific method “Science” is a method that uses observation and experimentation to find and explain regularities in nature. We need to • formulate precise questions, • employ appropriate measurement modalities, • identify factors that could confuse the answer, and • draw valid conclusions from the data. 4\nPage 6: Psychophysiology: Experimentation: Basics Concepts and constructs A concept is a generally accepted understanding of objects, situations, events, etc., in terms of associated characteristics or meanings. A construct is a more abstract idea, usually combining multiple concepts into a whole that is more difficult to verify. The concepts and constructs used in scientific research need to be defined carefully. Operationalisation creates a definition in terms of specific, measurable or otherwise testable criteria. 5\nPage 7: Psychophysiology: Experimentation: Basics Concepts and constructs: Example Heart rate is a concept, generally understood in terms of associated characteristics concerning the number of contractions a heart performs in a minute. EEG activity is a concept, generally understood in terms of voltage differences related to specific neuronal activity as measured by scalp electrodes. Mental workload is a construct that may be understood in terms of a specific parameter in a “workload task”, or in terms of specific patterns of cardial and EEG activity, or in terms of …? Physiological measurements usually clear—psychological phenomena in particular require careful operationalisation! 6\nPage 8: Psychophysiology: Experimentation: Basics Variables In experimental design, operationalised concepts and constructs are generally represented by variables. “… a variable is a symbol of an event, act, characteristic, trait, or attribute that can be measured and to which we assign values.” The regularities in nature which science aims to find are expressed as relationships between variables. Cooper, D. R., & Schindler, P. S. (2014). Business research methods (Twelfth ed.). New York, NY, USA: McGraw-Hill Irwin. 7\nPage 9: Psychophysiology: Experimentation: Basics Variables A relationship has at least one independent variable (IV) and one dependent variable (DV); e.g. “IV influences DV”. The IV is “manipulated” by the researcher in order to induce the assumed effect on the DV. The DV is then measured or otherwise observed to confirm. 8 Independent variable Dependent variable\nPage 10: Psychophysiology: Experimentation: Basics Variables Experimental manipulation can happen within-subjects, meaning different values of the IV are induced in the same test subjects, or between-subjects, meaning different test subjects are used for the different values of the IV. 9 Intelligence School performance Hunger School performance\nPage 11: Psychophysiology: Experimentation: Basics Variables Moderating variables (MoVs) influence the relationship, and are included to better describe the relationship. 10 Independent variable Dependent variable Moderating variable\nPage 12: Psychophysiology: Experimentation: Basics Variables Moderating variables (MoVs) influence the relationship, and are included to better describe the relationship. 11 Intelligence School performance Teaching quality\nPage 13: Psychophysiology: Experimentation: Basics Variables Mediating variables (MeVs) help explain the mechanisms of the IV-DV relationship, but are not manipulated directly. 12 Independent variable Dependent variable Mediating variable\nPage 14: Psychophysiology: Experimentation: Basics Variables Mediating variables (MeVs) help explain the mechanisms of the IV-DV relationship, but are not manipulated directly. 13 Intelligence School performance Student motivation\nPage 15: Psychophysiology: Experimentation: Basics Variables Mediating variables can be fully or partially mediating. 14 Intelligence School performance Student motivation\nPage 16: Psychophysiology: Experimentation: Basics Variables These are the variables that are part of the (hypothesised) theoretical model. - Independent variable: manipulated to induce an effect. - Dependent variable: measured to reveal the effect. - Moderating variable: influences a relationship. - Mediating variable: mediates a relationship. 15\nPage 17: Psychophysiology: Experimentation: Basics Variables What could a model for an EEG-based mental workload measurement look like? 16 IV: Task MeV: Workload MoV: Experience DV: EEG\nPage 18: Psychophysiology: Experimentation: Basics Variables There are additional variables that are not part of the theoretical model. They do not help explain the relationship of interest, but do play a role in our experiment investigating that relationship. - Extraneous variable (EV): any factor that might conceivably influence the relationship or the results. Usually ignored. - Control variable (CtV): EV that is included in the investigation in order to prevent biased results. - Confounding variable (CfV): relevant EV that we cannot (or forgot to) control for. 17\nPage 19: Psychophysiology: Experimentation: Basics Variables The CfV is often defined as influencing both the IV and the DV, causing a spurious relationship. More generally, CfVs can also act as MoVs or MeVs. 18 Ice cream sales People drowning Good weather\nPage 20: Psychophysiology: Experimentation: Basics Variables What are possible extraneous variables in the example “intelligence → school performance” model? Teacher, age, socioeconomic status, weather, colour of the classroom wall, … 19\nPage 21: Psychophysiology: Experimentation Basics of experimental design Experimentation involves the design of a testable theoretical model of a relationship that is assumed to exist in nature. Different kinds of variables are a part of that model. Other influences need to be controlled. 20\nPage 22: Psychophysiology: Experimentation Psychophysiology-specific design issues 21\nPage 23: Psychophysiology: Experimentation: Specifics Psychophysiological inference We assume that some psychological state Ψ (psi) is expressed as some physiological state Φ (phi). 22 IV: Ψ DV: Φ\nPage 24: Psychophysiology: Experimentation: Specifics Psychophysiological inference Multiple psychological, physiological, and environmental factors (EVs) may need to be included as IV or CtV to avoid confounded results. Multiple DVs may be required to find a pattern that is sufficiently specific to the IV. Figure: Cacioppo, J., Tassinary, L. G., & Berntson, G. G. (2000). The handbook of psychophysiology (Second ed., p. 12). New York, NY, USA: Cambridge University Press. 23\nPage 25: Psychophysiology: Experimentation: Specifics Information (data) sources We commonly collect from three sources of information. • Physiological • Subjective: • Questionnaires, interviews, debriefings … • Behavioural • Responses, response times, error rate … Aside from IV, DV, and MeV, these can be used as CtV. For example, a higher error rate (behaviour) may lead to frustration, biasing other parameters. 24\nPage 26: Psychophysiology: Experimentation: Specifics Within- versus between-subjects Because of individual differences, there is a large between- subjects variability of most psychophysiological measures. Within-subjects variability tends to be lower. Therefore, psychophysiology usually uses within-subjects designs. 25\nPage 27: Psychophysiology: Experimentation: Specifics: Within-subjects Within-subjects blockwise design Experiment with two workload conditions: “low” and “high”. Possible confound: fatigue 26 Low High time 1 hour 1 hour\nPage 28: Psychophysiology: Experimentation: Specifics: Within-subjects Within-subjects blockwise design Experiment with two workload conditions: “low” and “high”. Balanced or randomised conditions may control for temporal effects in within-subjects designs. 27 time 10 min HighLow HighLow HighLow HighLow 10 min 10 min 10 min 10 min 10 min 10 min 10 min\nPage 29: Psychophysiology: Experimentation: Specifics: Within-subjects Serial dependency Serial dependency between conditions may exist: participants may behave differently depending on the condition they perceived first (or previously). For example, in “noisy” and “quiet” conditions, adaptation first to noise or stillness may influence the way the other condition is perceived. A between-subjects design, or between-subjects control condition may be necessary. 28\nPage 30: Psychophysiology: Experimentation: Specifics: Within-subjects Serial dependency: Example Example: serial dependency caused different brain areas to dominate depending on a task being done first or second. Krol, L. R. (2020). Neuroadaptive technology: Concepts, tools, and validations (Doctoral thesis, Technische Universität Berlin, Germany). 29\nPage 31: Psychophysiology: Experimentation: Specifics Different analysis techniques 30 Generally speaking, two types of analysis techniques can be distinguished. • Continuous techniques consider a period of time as a whole, extracting parameters as DV that describe this period. IV is usually (a property of) an experimental condition. e.g.: Power in a frequency band throughout a condition. • Event-related techniques consider parameters following specific instances of time as DV. IV is usually (a property of) an experimental event. e.g.: Mean signal increase 200 ms after stimulus onset.\nPage 32: Psychophysiology: Experimentation: Specifics Continuous or event-related? Continuous Measuring engagement in a video game depending on difficulty level Measuring drowsiness during driving Measuring the ability to focus on one voice in mixed speech Event-related Measuring reactions to visually presented pictures Measuring the physiological processing of errors Measuring movement intentions 31 In many cases, (semi-)continuous measurements can also be performed using events, e.g. using a secondary task.\nPage 33: Psychophysiology: Experimentation: Specifics: Events Event-related analysis 32 Participant saw something they liked Participant noticed they made a mistake Participant stubbed their toe Event-related analysis thus focuses on changes in physiological activity relative to specific events, rather than activity generalized across conditions. Note that the measurement itself is still continuous. The event-related analysis considers small windows of time relative to the event of interest.\nPage 34: Psychophysiology: Experimentation: Specifics: Events Epoching and ERP averaging 33 In EEG, the resulting time windows reflect event-related potentials, as they reflect measured potential differences. A single such time window is usually too noisy to see any meaningful effects.\nPage 35: Psychophysiology: Experimentation: Specifics: Events Epoching and ERP averaging 34 Epoching is the practice of extracting all time segments relative to specific events from a recording. When you take the average ERP across multiple epochs, activity that does not systematically vary relative to the event and a specific baseline is averaged out.\nPage 36: Psychophysiology: Experimentation: Specifics: Events Event markers 35 Given the high frequency of some physiological signals and the sub-millisecond precision of the recording equipment, accurate timing of relevant experimental events is important. Additional equipment may be necessary to obtain so-called event markers or triggers that accurately reflect the timing of experimental stimuli or manual responses.\nPage 37: Psychophysiology: Experimentation: Specifics: Events Event markers Photo: © Brain Products GmbH 36\nPage 38: Psychophysiology: Experimentation: Specifics: Events Variable stimulus onset asynchrony 37 Variability of the signal requires multiple repetitions. These repetitions are usually spaced somewhat irregularly in time. 1 second s s s s s s s s 1 second s s s s s s s s\nPage 39: Psychophysiology: Experimentation: Specifics: Events Variable stimulus onset asynchrony Variable stimulus onset asynchrony avoids expectancy effects. Example: expectancy- related activity can be seen in EEG when participants anticipate upcoming events. Precisely-timed events may also systematically coincide with a particular phase of biosignal oscillations, creating a confound. 38 s s\nPage 40: Psychophysiology: Experimentation: Specifics Artefacts Specific focus of psychophysiological experimentation is on controlling EVs known as artefacts. “Artefacts” in the recording are those signals that do not represent the biosignal of interest. Artefacts can be of - external (mechanical, environmental), or - internal (biological) origin. 39\nPage 41: Psychophysiology: Experimentation: Specifics: Artefacts: External External artefacts Electromagnetic activity in the environment is picked up by the electrodes. Most commonly, this is utility-frequency (50 Hz) “line noise” coming from e.g. power cables, computers, light bulbs… Any electrical device operating at any frequency can potentially contaminate the recorded signal. 40\nPage 42: Psychophysiology: Experimentation: Specifics: Artefacts: External External artefacts: Example Graph by Benedikt Ehinger is licensed under CC BY 4.0 / Adjusted axis labels Train figure by klsgfx is in the public domain, via openclipart.org 41 50 Hz Line noise 16⅔ Hz ? !\nPage 43: Psychophysiology: Experimentation: Specifics: Artefacts: External Mechanical artefacts Mechanical artefacts are caused by movement of the equipment. The movement of an electrode across the skin can lead to differences in resistance, and thus differences in the recorded signal. The movement of electrode cables suspended in the air can lead to changes in their position in electromagnetic fields, thus causing differences in the recorded signal. 42\nPage 44: Psychophysiology: Experimentation: Specifics: Artefacts: External Controlling external artefacts Ahead of time: • Shield the room and the equipment. • Use electrodes with pre-amplifiers. • Have participants be stationary and comfortable. Post hoc: • Preprocess data to remove known artefacts. • Discard contaminated data. 43\nPage 45: Psychophysiology: Experimentation: Specifics: Artefacts Internal artefacts A number of biological processes can either directly interfere with, or otherwise influence, the biosignal of interest. For example, when using electrodes on the skin, skin potentials are slow impedance differences caused by sweating, leading to slow changes in the recorded signal. 44\nPage 46: Psychophysiology: Experimentation: Specifics: Artefacts: Internal Muscle activity Aside from causing mechanical artefacts, muscle activity by itself produces measurable electrical activity due to (near-)simultaneous muscle fiber action potentials. Being high-amplitude and near the surface of the skin, these signals interfere with other signals recorded at the skin. Figure by OpenStax, Tomáš Kebert and umimeto.org is licensed under CC BY-SA 4.0 / Cropped two halves together 45\nPage 47: Psychophysiology: Experimentation: Specifics: Artefacts: Internal Muscle activity in EEG Stern, J. (2013). Atlas of EEG Patterns (second ed.). Philadelphia, PA: Lippincott Williams & Wilkins. 46\nPage 48: Psychophysiology: Experimentation: Specifics: Artefacts: Internal Second-order internal artefacts Rather than producing activity that interferes with the biosignal of interest, a number of natural biological processes influence the biosignal of interest itself. For example, the respiratory cycle can be seen in ECG: breathing in increases the heart rate, and breathing out decreases it. In psychophysiology, essentially any psychological state that is not the Ψ of interest can influence Φ and affect the recording. 47\nPage 49: Psychophysiology: Experimentation: Specifics: Artefacts Systematic versus random artefacts When artefacts are sufficiently random across conditions, their effects may ideally average out. Internal artefacts in particular can be systematically related to the experimental manipulation. This can lead to erroneous conclusions about the experimental effect. - More sweating in one condition - Frowning when something goes wrong - Eye blinks after stimulus onset - Personal thoughts specific to one condition 48\nPage 50: Psychophysiology: Experimentation: Specifics: Artefacts Controlling internal artefacts Neutral, temperature- controlled environment Low electrode impedance Comfortable, stationary participants Guided gaze fixation Signal post-processing Exclude contaminated data Clever experimental design! Photo by University of Southampton, via AAAS / EurekAlert! 49\nPage 51: Psychophysiology: Experimentation: Specifics: Artefacts Artefacts galore? Mobile Brain/Body Imaging Video by Berlin Mobile Brain/Body Imaging Lab (BeMoBIL) is licensed under CC BY 4.0 50\nPage 52: Psychophysiology: Experimentation Psychophysiology-specific design issues In psychophysiology, the independent variable is usually a psychological state, and the dependent variable a physiological measurement. Physiological parameters can be event- related or continuous. Special care must be taken that external and internal artefacts are controlled for. Note that artefacts can be systematically related to the manipulation. 51\nPage 53: Psychophysiology: Experimentation Additional issues to consider 52\nPage 54: Psychophysiology: Experimentation: Issues Ethics of human experimentation 53 Psychophysiological experimentation relies on human participants. The experimenter is responsible for the well- being of their participants. Research comes second. Declaration of Helsinki (1964; current revision 2013) agreed, among other things, on participant’s right to - make informed decisions (e.g. informed consent) - self-determination (e.g. quit experiment at any time) - not be subjected to unnecessary risks, etc.\nPage 55: Psychophysiology: Experimentation: Issues Incidental findings 54 Even non-medical experimental recordings may reveal indications of medical significance, e.g. related to epilepsy (EEG), cysts (fMRI), or cardiac arrhythmia (ECG). Send recorded data for medical review? Inform participants of these findings? Psychophysiological research does not generally use standardized tests for reliable clinical diagnosis. Likely to find many false positives. Participants may or may not want to know.\nPage 56: * Psychophysiology Part 4: Psychophysiological experimentation Dr. Laurens R. Krol krol@b-tu.de 55"
  },
  {
    "id": "psychophysiology-5-electromyography",
    "title": "Psychophysiology 5 Electromyography",
    "sourceFile": "Psychophysiology 5 Electromyography.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 5: Electromyography Dr. Laurens R. Krol Dr. Marius Klug 2024-05-21 0\nPage 2: Psychophysiology Electromyography (EMG) History Physiological origins Measuring EMG Analysis of EMG 1\nPage 3: Psychophysiology: Electromyography History 2\nPage 4: Psychophysiology: Electromyography History The electric organ in fish was discovered to consist of specialized muscle cells by Francesco Redi and Stefano Lorenzini in the 17th century. Also because no sparks were visible during movement, shock and muscle activity was assumed to be mechanical in nature. In 1773, sparks from an eel’s shock were finally demonstrated by John Walsh. Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. Figure: Risso, A. (1810). Ichthyologie de Nice. Paris, FR: F. Schoell. 3\nPage 5: Psychophysiology: Electromyography History Walsh, J. (1773). Of the Electric Property of the Torpedo. In a Letter from John Walsh, Esq; F. R. S. to Benjamin Franklin, Esq; LL.D., F. R. S., Ac. R. Par. Soc. Ext., &c. Philosophical Transactions, 63 (1773-1774), pp. 461-480. Illustration : Risso, A. (1810). Ichthyologie de Nice. Paris, FR: F. Schoell. 4 …\nPage 6: Psychophysiology: History History In 1791, Luigi Galvani discovered that frog legs twitched when subjected to electrical current. Ultimately, Emil du Bois-Reymond (1849) used a galvanometer to demonstrate increased electric activity during muscle contractions. Illustration: Hogg, J. (1861). Elements of experimental and natural philosophy (p. 502). London, UK: Henry G. Bohn. 5\nPage 7: Psychophysiology: Electromyography Physiological origins 6\nPage 8: Psychophysiology: Electromyography: Physiology Muscle types • Smooth muscle (involuntary, ANS- controlled) • Cardiac muscle (striated; involuntary, ANS- controlled) • Skeletal muscle (striated; voluntary, SNS-controlled) Striated refers its striated appearance under a microscope. Photograph of “Lotti” (1925) by Mac Walten is in the Stadtmuseum Berlin 7\nPage 9: Psychophysiology: Electromyography: Physiology Voluntary control? • Facial expressions • Shivering when cold • Muscle tension due to disorders and stress • Relaxation during sleep Photo: Ospan Ali on Unsplash 8\nPage 10: Psychophysiology: Electromyography: Physiology Skeletal muscle Figure by OpenStax is licensed under CC BY 4.0 9\nPage 11: Psychophysiology: Electromyography: Physiology Sarcomere Figures by Louisa Howard are in the public domain 10 Sarcomere A band I bandI band H zone Z lineZ line M line\nPage 12: Psychophysiology: Electromyography: Physiology Muscle fiber and myofibril Figure by OpenStax is licensed under CC BY 4.0 11\nPage 13: Psychophysiology: Electromyography: Physiology Sarcomere Figure by OpenStax is licensed under CC BY 4.0 12\nPage 14: Psychophysiology: Electromyography: Physiology Sarcomere contraction Figure by OpenStax is licensed under CC BY 4.0 13\nPage 15: Psychophysiology: Electromyography: Physiology Neuromuscular junction Figure by Doctor Jana is licensed under CC BY 4.0 14\nPage 16: Psychophysiology: Electromyography: Physiology Motor units A motor unit consists of a single motor neuron, its axon, and all the muscle fibers innervated by it. Activation of a motor unit follows an all-or-nothing principle. Activation of a muscle can vary depending on the amount and size of active motor units. The ratio ranges from 1:3 to 1:3000, allowing fine or gross motor activity. 15\nPage 17: Psychophysiology: Electromyography: Physiology Motor unit / muscle fiber action potentials A motor unit action potential (MUAP) is carried by the neuron, triggering a muscle fiber action potential (MFAP) in the postsynaptic muscle fibers. Muscle fiber action potentials have • a slightly lower resting potential (-85 mV), • a slightly longer duration (up to 5 ms), and • a slower velocity (3 – 5 m/s). 16\nPage 18: Psychophysiology: Electromyography: Physiology Origin of EMG 17 A R + + – ++++ + mV\nPage 19: Psychophysiology: Electromyography: Physiology Motor unit potentials A motor unit potential (MUP) refers to the sum of all muscle fiber action potentials of a single motor unit. This is what EMG measures. The measured signal is thus a function of • the number of detected active motor units, and • the rate at which they are firing. Multiple motor units each firing at around a maximum of 50 Hz, but not all firing at the same time, can add up to much higher frequencies. This is why muscle activity is often broadband signal. 18\nPage 20: Psychophysiology: Electromyography Measuring EMG 19\nPage 21: Psychophysiology: Electromyography: Measurement The EMG signal: Raw Figure by StruskaM is licensed under CC BY-SA 4.0 20\nPage 22: Psychophysiology: Electromyography: Measurement The EMG signal: Spectrum Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. 21\nPage 23: Psychophysiology: Electromyography: Measurement Recording The amplifier needs to be capable of recording broad spectrum signal with most power in 40 – 100 Hz. Good ground site important to filter out overlapping mains noise. High-pass filter can be applied to filter out eye activity when recording from the face. Subdermal electrodes can be used for precise measurement. Abrade the skin before applying surface electrodes. Smaller sizes can be used for face recordings. 22\nPage 24: Psychophysiology: Electromyography: Measurement Electrode placement Usually a bipolar recording with one electrode placed in the middle, the other at the end of the muscle of interest A few mm can make a big difference. • Absolute value are therefore mostly meaningless. • Repeated measures are difficult, even within subjects. • Focus on within-subject, within-session differences. 23\nPage 25: Psychophysiology: Electromyography: Measurement Electrode placement: Face 24 Left: Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. Right: Davis, J. F. (1959). Manual of surface electromyography (WADC Tech. Rep. No. 59-184). Dayton, OH, USA: Wright Air Development Center\nPage 26: Psychophysiology: Electromyography: Measurement Facial muscle relevance 25 Figure: Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. Corrugator: frown Orbicularis: bright light, averse stimuli Levator: disgust Mentalis: sleep Zygomaticus: smile\nPage 27: Psychophysiology: Electromyography: Measurement Electrode placement: Body 26 Left: Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. Right: Davis, J. F. (1959). Manual of surface electromyography (WADC Tech. Rep. No. 59-184). Dayton, OH, USA: Wright Air Development Center\nPage 28: Psychophysiology: Electromyography: Measurement Body muscle relevance Splenius (neck): aversive stimuli Trapezius: stress Tibialis (leg): stress Figure: Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. 27\nPage 29: Psychophysiology: Electromyography: Measurement Artefacts Aside from the obvious, in particular • posture, • movement artefacts, • electrode shifts due to muscular activity, and sometimes • ECG, depending on electrode positions, need to be taken into account. 28\nPage 30: Psychophysiology: Electromyography Analysing EMG 29\nPage 31: Psychophysiology: Electromyography: Analysis The EMG signal: Raw Figure by StruskaM is licensed under CC BY-SA 4.0 30\nPage 32: Psychophysiology: Electromyography: Analysis EMG processing 1. Raw signal 2. Rectification • Half-wave: Only retain positive samples • Full-wave: take absolute values 3. Smoothing 4. Integration Figure: Cacioppo, J. T. & Tassinary, Louis G. (1990). Principles of psychophysiology: Physical, social, and inferential elements. Cambridge, UK: Cambridge University Press. 31\nPage 33: Psychophysiology: Electromyography: Analysis EMG processing: Integration Quote: Andreassi, J. L. (2000). Psychophysiology: Human behaviour & physiological response. Mahwah, NJ, USA: Lawrence Erlbaum. 32 Integration reflects a measure of “total EMG output over a given period of time”. The period of time is thus a free parameter, dependent on the research question, and can vary from milliseconds to seconds.\nPage 34: Psychophysiology: Electromyography: Analysis Example Dimberg, U., & Thunberg, M. (2012). Empathy, emotional contagion, and rapid facial reactions to angry and happy facial expressions. PsyCh Journal, 1(2), 118-127. 33\nPage 35: Psychophysiology: Electromyography: Analysis Example Dimberg, U., Thunberg, M., & Elmehed, K. (2000). Unconscious facial reactions to emotional facial expressions. Psychological Science, 11(1), 86-89. 34\nPage 36: Psychophysiology: Electromyography: Analysis Example 't Hart, B., Struiksma, M. E., van Boxtel, A., & van Berkum, J. J. A. (2018). Emotion in stories: Facial EMG evidence for both mental simulation and moral evaluation. Frontiers in Psychology, 9, 613. 35\nPage 37: Psychophysiology Electromyography Simultaneous motor fiber action potentials recorded from surface electrodes result in a broad-spectrum signal. Through integration over time, a general EMG output signal can be constructed. The activity of different muscles, in particular those in the face, can be correlated to different psychological states. 36\nPage 38: * Psychophysiology Part 5: Electromyography Dr. Laurens R. Krol krol@b-tu.de 37"
  },
  {
    "id": "psychophysiology-6-1-cardiovascular-system",
    "title": "Psychophysiology 6.1 Cardiovascular System",
    "sourceFile": "Psychophysiology 6.1 Cardiovascular system.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 6.1: The cardiovascular system Dr. Laurens R. Krol Dr. Marius Klug 0\nPage 2: Psychophysiology: Cardiovascular system Introduction Illustration: Royal Collection Trust / © Her Majesty Queen Elizabeth II 2021 Photo: © 2020 Longines Watch Co. Francillon Ltd. 1\nPage 3: Psychophysiology: Cardiovascular system Function The cardiovascular system, with the heart as its main “pump”, serves to transport blood to and from the organs. This - brings necessary oxygen and nutrients to the organs; - transports waste products; - regulates the bodily temperature; and - aids endocrine communication. Cardiovascular activity varies as the energy requirements of the body vary. 2\nPage 4: Psychophysiology: Cardiovascular system Cardiovascular system Figure by OpenStax is licensed under CC BY 4.0 / Cropped head, resized heart cutout 3\nPage 5: Artery Vein Capillaries Psychophysiology: Cardiovascular system Blood vessels Arteries carry blood away from the heart. Capillaries are microvessels; oxygen, nutrients, and waste products can pass through their walls. Veins carry blood towards the heart. Figure ”Circulatory system” by Mariana Ruiz Villarreal is in the public domain. Figure “Capillary system” is in the public domain. 4\nPage 6: Psychophysiology: Cardiovascular system Blood vessels Figure “Blood vessels (retouched) -en” by Begoon/Kelvinsong is licensed under CC BY-SA 3.0 5\nPage 7: Psychophysiology: Cardiovascular system The heart 6\nPage 8: Psychophysiology: Cardiovascular system: Heart Cardiac anatomy Figure by OpenStax is licensed under CC BY 4.0 / Cropped out heart 7\nPage 9: Psychophysiology: Cardiovascular system: Heart Cardiac activity Animation “CG heart 2” by DrJanaOfficial is licensed under CC BY-SA 4.0 Audio by EmilyHopeS is licensed under CC BY-SA 4.0 / Trimmed, adjusted speed 8\nPage 10: Psychophysiology: Cardiovascular system: Heart Wiggers diagram Figure “Wiggers Diagram” by Xavax is licensed under CC BY-SA 2.5 / Changed colours 9 r i re ure ri re ure e ri u r re ure e ri u r u e e r r i gr r i gr y e i e y e r re ure g u e r i e e r i e e i r e e i r e e\nPage 11: Psychophysiology: Cardiovascular system: Heart Interactive Wiggers diagram HyperHeart by Quentin Roper is licensed under CC BY-NC 4.0 10 https://library.med.utah.edu/kw/pharm/hyperheart\nPage 12: Psychophysiology: Cardiovascular system: Heart Cardiac muscles Figures by OpenStax are licensed under CC BY 4.0 11\nPage 13: Psychophysiology: Cardiovascular system: Heart Myocardium The myocardium, or the heart muscles, comprises the thickest of the multiple layers of the heart. This heart musculature is different from smooth and skeletal muscles. A small percentage of cardiac muscle cells, known as pacemaker cells, has the ability to spontaneously produce action potentials. They automatically depolarise over time without external stimulation, and cause the muscle to contract. This is known as autorhythmicity. Cardiac muscle cells (cardiomyocites) are connected to each other through gap junctions, allowing cardiac action potentials to be freely conducted between cells. 12\nPage 14: Psychophysiology: Cardiovascular system: Heart Pacemaker (conductive) cells Figure by OpenStax is licensed under CC BY 4.0 / cropped 13\nPage 15: Psychophysiology: Cardiovascular system: Heart Contractive cells Figure by OpenStax is licensed under CC BY 4.0 / cropped 14\nPage 16: Psychophysiology: Cardiovascular system: Heart Neural conduction The sinoatrial node is a group of pacemaker cells located at the superior wall of the right atrium. Its signal contracts the atria, and then reaches the atrioventricular node near the inferior part of the interatrial septum. This node slightly delays the signal, allowing the atria to fully contract, before conducting the signal through the Bundle of Hiss and the Purkinje fibers into the ventricular walls, which then contract. 15\nPage 17: Psychophysiology: Cardiovascular system: Heart Neural conduction Figure by OpenStax is licensed under CC BY 4.0 16\nPage 18: Psychophysiology: Cardiovascular system: Heart Heart rate The SA node is the primary pacemaker, with the AV node yoked to its sinus rhythm. The SA node has an intrinsic rhythmicity of about 100 bpm; the AV node of about 40-60 bpm, the Bundle of His 20-40. The fastest available rhythm dominates the others. A denervated heart would beat on its own at around 100 bpm. The autonomous nervous system can modulate the cardiac autorhytmicity, both to slow it down (parasympathetic) and to speed it up (sympathetic) as needed. 17\nPage 19: Psychophysiology: Cardiovascular system: Heart Autonomic influence Figure by OpenStax is licensed under CC BY 4.0 / cropped, removed text 18 Neurotransmitters open additional Na+ and Ca2+ channels (sympathetic), or open additional K+ channels (parasympathetic), influencing the rate of depolarization.\nPage 20: Psychophysiology: Cardiovascular system: Heart Neural conduction and the ECG Figure “ECG principle slow” by Kalumet is licensed under CC BY-SA 3.0 19\nPage 21: Psychophysiology The cardiovascular system The cardiovascular system contains a pulmonary and a systemic circulation, driven by two each of the four chambers of the heart: the right and left, respectively, atria and ventricles. The myocardium contains pacemaker cells with an instable resting potential, producing autorhythmicity. Neural conduction, also enabled by the gap junctions between the cardiomyocites, spreads throughout the heart and causes sequential contractions. 20\nPage 22: * Psychophysiology Part 6.1: The cardiovascular system Dr. Laurens R. Krol krol@b-tu.de 21"
  },
  {
    "id": "psychophysiology-6-2-cardiovascular-measures",
    "title": "Psychophysiology 6.2 Cardiovascular Measures",
    "sourceFile": "Psychophysiology 6.2 Cardiovascular measures.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 6.2: Cardiovascular measures Dr. Laurens R. Krol Dr. Marius Klug 2024-06-11\nPage 2: Psychophysiology Cardiovascular measures Blood pressure Peripheral blood volume The electrocardiogram 2021-10-20 1\nPage 3: Psychophysiology Blood pressure 2021-10-20 2\nPage 4: Psychophysiology: Cardiovascular Blood pressure Pressure refers to a force acting upon a surface. In the cardiovascular circulations, blood presses against the vessel walls. In medicine, the unit millimetres of Mercury (mmHg) is generally used instead of the SI unit Pascal (N/m²). Figure: Flammarion, C. (1872). L’Atmosphère: Descriptions des Grands Phénomènes de la Nature (pp. 35). Paris: Librairie Hachette et Cie. 3\nPage 5: Psychophysiology: Cardiovascular: Pressure Blood pressure in the systemic circulation Figure by OpenStax is licensed under CC BY-SA 4.0 4\nPage 6: Psychophysiology: Cardiovascular: Pressure Blood pressure and the baroreflex Pressure depends on the cardiac output (heart rate × stroke volume), and on vascular resistance (vessel elasticity and diameter). The baroreflex and other feedback loops regulate these parameters. In the baroreflex, when arterial baroreceptors sense an increase in blood pressure, this leads to a decrease in cardiac output, and vice versa. 5\nPage 7: Psychophysiology: Cardiovascular: Pressure Cardiovascular innervation Figure source unknown 6 The vasomotor centre in the medulla oblongata regulates blood pressure. The heart has both para- and sympathetic efferents; most blood vessels only have sympathetic innervation (effecting mostly vasoconstriction). Higher structures (cerebral cortex, limbic system) can influence the vasomotor centre, which explains cardiovascular responses to e.g. emotional stress.\nPage 8: Psychophysiology: Cardiovascular: Pressure: Measurement Sphygmomanometry Photo by ML5 is in the public domain Diagram “Korotkow English” by PhilippN is licensed under CC BY-SA 3.0 7\nPage 9: Psychophysiology: Cardiovascular: Pressure: Measurement Sphygmomanometry: Disadvantages 8 Not fully accurate: may be off by some 5-10 mmHg Temporarily deforms the arteries: a 10-minute recovery period should be allowed before additional measurements on the same arm Not continuously measurable Not unobtrusively measurable\nPage 10: Psychophysiology: Cardiovascular: Pressure: Measurement Continuous measurement Continuous measurement of true blood pressure is only possible invasively. An arterial line must be inserted into the artery. Other techniques have been developed, but rely on correlations of blood pressure with other measures. These correlations are complex. No standard has yet emerged. Figure © Maryanne Mariyaselvam / KLIPS 9\nPage 11: Psychophysiology Blood pressure Blood pressure varies between systolic maxima and diastolic minima, which can be measured in the arteries. Sphygmomanometry is commonly used to obtain single measures of blood pressure. Continuous measurement for psychophysiology is not practically viable. 2021-10-20 10\nPage 12: Psychophysiology Peripheral blood volume 2021-10-20 11\nPage 13: Psychophysiology: Cardiovascular Peripheral blood volume Vasomotor activity of peripheral blood vessels allows more or less blood to enter specific regions. This is sometimes readily observed, e.g. in blushing. Accurate measures can also detect minimal changes, some of which have psychological relevance. Figure: Wappers, G. (1827). Anthonie van Dijck verliefd op zijn model. Rijksmuseum SK-A-1159 12\nPage 14: Psychophysiology: Cardiovascular Peripheral blood volume Peripheral blood volume is usually measured at the finger, where many blood vessels are close to the skin surface. Furthermore, measurements at the finger are not complicated by the presence of skeletal muscles. Vasomotor activity in the skin is exclusively under sympathetic control. Peripheral blood volume measures thus indirectly describe sympathetic ANS activity. Peripheral blood volume also varies with heart rate: systole increases, and diastole decreases the blood volume in the arteries. As a result, it is often primarily used as a heart rate monitor. 13\nPage 15: Psychophysiology: Cardiovascular: Volume Photoplethysmography (PPG) A plethysmograph measures and records changes in the volume of a (part of a) body. A photoplethysmograph uses infrared light to measure changes in blood volume indirectly. It detects changes in light absorption and refraction, which depend on blood perfusion. Top figure “Hospital Pulse Oximeter (22924168424)” by Tony Webster is licensed under CC BY-SA 2.0 / Cropped, adjusted colours Bottom figure “Saturometre 2” by Rama is licensed under CC BY-SA 2.0 FR 14\nPage 16: Psychophysiology: Cardiovascular: Volume Photoplethysmogram Upper left figure by Peter H Charlton is licensed under CC BY 4.0 / Adapted axes Remaining figures, from Chowdhury, M. H., Shuzan, M. N. I., Chowdhury, M. E., Mahbub, Z. B., Uddin, M. M., Khandakar, A., & Reaz, M. B. I. (2020). Estimating blood pressure from the photoplethysmogram signal and demographic features using machine learning techniques. Sensors, 20(11), 3127, are licensed under CC BY 4.0 15 1 second\nPage 17: Psychophysiology: Cardiovascular: Volume Photoplethysmography: Disadvantages Local measurements are susceptible to local noise, primarily related to temperature and movement. Local measurements may not correspond to whole-body physiology. 16\nPage 18: Psychophysiology: Cardiovascular: Volume “Webcam photoplethysmography” Wu, H. Y., Rubinstein, M., Shih, E., Guttag, J., Durand, F., & Freeman, W. (2012). Eulerian video magnification for revealing subtle changes in the world. ACM Transactions on Graphics (TOG), 31(4), 1-8. 17\nPage 19: Psychophysiology Peripheral blood volume Photoplethysmography is an indirect, but simple method to measure peripheral blood volume. Aside from blood volume, the resulting PPG allows measures that correlate with heart rate and other physiological indications to be extracted. 2021-10-20 18\nPage 20: Psychophysiology The electrocardiogram 2021-10-20 19\nPage 21: Psychophysiology: Cardiovascular Electrocardiography An electrocardiogram (ECG) measures and records the biopotentials generated by cardiac electrical activity. This activity represents the summed action potentials of the myocardium throughout the cardiac cycle. The high amplitude of the ECG biosignal makes it detectable even with generic hardware. The activity is in the range of 1-100 Hz. There are a number of different ways to place the electrodes. 20\nPage 22: Psychophysiology: Cardiovascular: ECG Electrode (lead) placement 21\nPage 23: Psychophysiology: Cardiovascular: ECG: Placement Einthoven’s triangle 22\nPage 24: Psychophysiology: Cardiovascular: ECG: Placement Einthoven I, II, and III Figure by 10ebyu10e is licensed under CC BY-SA 4.0 23\nPage 25: Psychophysiology: Cardiovascular: ECG: Placement Modern developments Diagram and upper photo by OpenStax are licensed under CC BY-SA 4.0 Lower photo © VivaLNK, Inc. 24\nPage 26: Psychophysiology: Cardiovascular: ECG Peaks and intervals Figure by Agateller (Anthony Atkielski)/atom is in the public domain 25 P: Atrial depolarization QRS: Ventricular depolarization T: Ventricular repolarisation\nPage 27: Psychophysiology: Cardiovascular system: Heart Neural conduction and the ECG Figure “ECG principle slow” by Kalumet is licensed under CC BY-SA 3.0 26\nPage 28: Psychophysiology: Cardiovascular: ECG Electrocardiogram Figure “Nsr” by ECGpedia is licensed under CC BY-NC-SA 3.0 / Removed fifth cycle 27\nPage 29: Psychophysiology: Cardiovascular: ECG Ventricular fibrillation Figure “Ventricular fibrillation” by Jer5150 is licensed under CC BY-SA 3.0 Figure “Automated External Defibrillator Amsterdam airport” by Stevenfruitsmaak is licensed under CC BY-SA 3.0 28\nPage 30: Psychophysiology: Cardiovascular: ECG: Parameters Heart rate Heart rate (HR) is the number of contractions (beats) of a heart per minute (bpm). Easily operationalised from an ECG as the number of R peaks per minute. HR responds to almost all physical and psychological changes: e.g., pain and fear increase, whereas relaxation and attention decrease HR; but even circadian and menstrual cycles can influence HR. This bidirectionality is an advantage for psychophysiology. Slow changes can be recorded by taking e.g. HR measurements per minute. 29\nPage 31: Psychophysiology: Cardiovascular: ECG: Parameters Heart rate variability Changes in HR can also be operationalised as another metric in itself: heart rate variability (HRV). The inter-beat interval (IBI) is the distance between two successive R peaks. Many metrics can be constructed from this, e.g. arithmetic means, standard deviations, RMSSD = σ𝑖=1 𝑁−1 (𝐼𝐵𝐼𝑖+1−𝐼𝐵𝐼𝑖)2 𝑁−1 , proportion of successive intervals above a threshold, … RMSSD (root mean square of successive differences) is often preferred for statistical reasons. HRV also allows spectral analyses. 30\nPage 32: Psychophysiology: Cardiovascular: ECG: Parameters: HRV Spectral analysis: Cardiac time 31 1100 ms 900 ms 1050 ms 800 ms Time (ms) 1500 500 1 2 3 4 5 … Cardiac time (beats)\nPage 33: Psychophysiology: Cardiovascular: ECG: Parameters: HRV Spectral analysis: Actual time 32 1100 ms 900 ms 1050 ms 800 ms Time (ms) 1500 500 0 1100 2000 3050 3850 Actual time (ms)\nPage 34: Psychophysiology: Cardiovascular: ECG: Parameters: HRV Spectral analysis: Processed signal Lombardi, F. (1997). Spectral Analysis of Heart Rate Variability. Cardiac Electrophysiology Review, 3, 335-337. 33\nPage 35: Psychophysiology: Cardiovascular: ECG: Parameters: HRV Spectral analysis Lombardi, F. (1997). Spectral Analysis of Heart Rate Variability. Cardiac Electrophysiology Review, 3, 335-337. 34\nPage 36: Psychophysiology: Cardiovascular: ECG: Parameters: HRV Interpretation Very Low Frequency (0 - 0,04 Hz): • Circadian rhythm, metabolism, thermoregulation Low Frequency (0,04 - 0,15 Hz): • Blood pressure regulation • Para- and (mostly) sympathetic modulation High Frequency (0,15 - 0,40 Hz) • Respiratory sinus arrhythmia • Parasympathetic modulation LF / HF Ratio • Balance of para-/sympathetic activity 2021-10-20 35\nPage 37: Psychophysiology The electrocardiogram The electrocardiogram traces biopotentials generated by simultaneous muscle fiber activity in the myocardium. The various peaks and intervals have clinical significance. In psychophysiology, more focus is placed on heart rate and heart rate variability. HRV can be spectrally analysed to obtain information about ANS balance. 36\nPage 38: * Psychophysiology Part 6.2: Cardiovascular measures Dr. Laurens R. Krol krol@b-tu.de 37"
  },
  {
    "id": "psychophysiology-7-electrodermal-activity",
    "title": "Psychophysiology 7 Electrodermal Activity",
    "sourceFile": "Psychophysiology 7 Electrodermal activity.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 7: Electrodermal activity Dr. Laurens R. Krol Dr. Marius Klug 0\nPage 2: Psychophysiology Electrodermal activity (EDA) History The human skin Measuring EDA Analysis of EDA 1\nPage 3: Psychophysiology: Electrodermal activity History Woodworth, R. S. & Schlosberg, H. (1961). Experimental psychology. London, UK: Methuen. Portrait of Tarkhanov by Ilya Repin is in The State Russian Museum 2 In 1888, Charles Féré“attached two electrodes on the forearm, connected in series with a weak current and a galvanometer.” He found deflections when the participant “was stimulated by a tuning fork, an odor, or a colored glass before his eyes.” In 1890, Ivan Tarkhanov found similar results without a current.\nPage 4: Psychophysiology: Electrodermal activity History Andreassi, J. L. (2000). Psychophysiology: Human behaviour & physiological response. Mahwah, NJ, USA: Lawrence Erlbaum. Photo of Carl Jung from the ETH Library is in the public domain 3 Both methods immediately generated interest, and were applied i.a. by Carl Jung in the early 1900s “to study emotional reactions of his patients to word associations”. Féré had measured a sweat-induced change in skin conductance. Tarkhanov had detected skin potentials.\nPage 5: Psychophysiology: Electrodermal activity History Other names for the same or similar effects: • Galvanic skin response • Electrodermal response • Psychogalvanic reflex • Sympathetic skin response • … 4\nPage 6: Psychophysiology The human skin 5\nPage 7: Psychophysiology: Electrodermal activity: Skin Main functions 6 • Protection • Against the external environment • Against mechanical damage • Against pathogens • Against loss of water, nutrients … • Sensation • Temperature, pressure, vibration, injury … • Regulation • Blood vessel dilation and constriction • “Goose bumps” • Sweat glands\nPage 8: Psychophysiology: Electrodermal activity: Skin Histology of the skin “Skin layers” by Madhero88 and Michał Komorniczak is licensed under CC BY-SA 3.0 / Added cutis 7 Cutis\nPage 9: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the dermis Figure from the National Cancer Institute is in the public domain 8 Reticular layer Papillary layer\nPage 10: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the dermis 9 The reticular layer is the main part of the dermis, containing various structural fibers as well as blood vessels, glands, hair follicles, and sensory neurons. The subcutaneous tissue or hypodermis below is not technically considered to be part of the skin, but connects the skin to the body. Reticular layer\nPage 11: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the dermis 10 The papillary layer connects to the epidermal basal layer and is named for the dermal papillae. Dermal papillae are small extensions that project into the epidermis, improving the exchange of oxygen, nutrients, and waste products, as the epidermis has no blood vessels. They also strengthen the bond between dermis and epidermis. They appear as ridges on the epidermis of thick skin, known as fingerprints on the fingertips. Papillary layer\nPage 12: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis “Skinlayers_(italiano)” by Adert / Fulvio314 is licensed under CC BY-SA 3.0 / Removed, recreated labels 11 Epidermal cells are primarily keratinocytes producing keratin and other substances that protect the skin. These cells are generated in the stratum basale and pushed upwards. The outer stratum corneum consists of these dead cells, plus their secretions. Stratum corneum Stratum lucidum Stratum granulosum Stratum spinosum Stratum basale\nPage 13: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis “Skinlayers_(italiano)” by Adert / Fulvio314 is licensed under CC BY-SA 3.0 / Removed, recreated labels 12 Strati: corneum lucidum granulosum spinosum basale The stratum basale contains a single layer of basal cells which serve as stem cells to create keratinocytes through mitosis, pushing the existing cells outwards. It also contains sensory receptor cells for touch (Merkel cells), as well as melanocytes, creating melanin. The stratum basale is connected to the lower dermis.\nPage 14: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis “Skinlayers_(italiano)” by Adert / Fulvio314 is licensed under CC BY-SA 3.0 / Removed, recreated labels 13 Strati: corneum lucidum granulosum spinosum basale The stratum spinosum consists of approximately 10 layers of young keratinocytes, providing water resistance. This layer also contains Langerhans cells, parts of the immune system that protect against bacteria and other foreign particles.\nPage 15: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis “Skinlayers_(italiano)” by Adert / Fulvio314 is licensed under CC BY-SA 3.0 / Removed, recreated labels 14 Strati: corneum lucidum granulosum spinosum basale In the stratum granulosum, 3 – 5 layers of keratinocytes create large amounts of keratin and other proteins, before dying.\nPage 16: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis “Skinlayers_(italiano)” by Adert / Fulvio314 is licensed under CC BY-SA 3.0 / Removed, recreated labels 15 Strati: corneum lucidum granulosum spinosum basale This layer, the stratum lucidum, only exists in the sections of “thick skin” in the palms of the hand and the soles of the feet. It consists of 3 – 5 layers of dead keratinocytes and a derivate protein, giving it a translucent appearance.\nPage 17: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis “Skinlayers_(italiano)” by Adert / Fulvio314 is licensed under CC BY-SA 3.0 / Removed, recreated labels 16 Strati: corneum lucidum granulosum spinosum basale The stratum corneum is the outermost layer of the skin. With 10 – 30 layers of cells, it is thickest at the palms and soles. Consisting of dead, dry, keratinized cells, this layer serves as a physical barrier against external substances and mechanical influences. This layer is shed by friction, and replaced with new cells from lower layers approximately every four weeks.\nPage 18: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the dermis Figure by Kilbad is in the public domain 17\nPage 19: Psychophysiology: Electrodermal activity: Skin: Histology Layers of the epidermis Figure “Epidermal layers” by Mikael Häggström / Wbensmith is licensed under CC BY-SA 3.0 18\nPage 20: Psychophysiology: Electrodermal activity: Skin: Histology Sweat glands Sweat glands are a type of exocrine gland, secreting products through a duct onto an outer tissue layer, as opposed to endocrine glands, which secrete directly into the bloodstream. • Apocrine sweat glands secrete relatively oily liquid containing proteins and fats. They are only found in specific regions (e.g. armpits, areola, anus, pubic), and begin working during puberty. • Eccrine sweat glands secrete 99% clear H2O, and are present almost everywhere. An estimated 2 – 5 million glands are found at different densities, with ~2000/cm2 at the palms and soles, down to ~100/cm2 elsewhere. 19\nPage 21: Psychophysiology: Electrodermal activity: Skin: Histology Sweat glands “HautFingerspitzeOCT” by the medOCT group, Medical University Vienna, Austria is licensed under CC BY-SA 2.0 AT 20\nPage 22: Psychophysiology: Electrodermal activity Skin conductance Eccrine sweat glands are known to be the main factor in skin conductance, because: • Skin conductance is strongest in areas with the highest density of eccrine sweat glands, even though the skin itself is thicker there. • EDA responses are strongest in those same areas. • No such responses are measured in people without eccrine sweat glands. • The response can be eliminated by e.g. chemically blocking the signals responsible for gland activation. Gramann, K., & Schandry, R. (2009). Psychophysiologie (4th ed.). Basel, Switzerland: Beltz. 21\nPage 23: Psychophysiology: Electrodermal activity: Skin Eccrine sweat gland innervation Eccrine sweat glands are exclusively under sympathetic control. Electrodermal activity (EDA) appears to be a complex reaction, involving, aside from local skin processes, CNS systems related to (loco)motion, arousal, emotion, and motivation. • Motor cortex, some basal ganglia → (loco)motion • Reticular formation → arousal • Limbic system → emotion (and thermoregulation) • (Frontotemporal) cortex → motivation Gramann, K., & Schandry, R. (2009). Psychophysiologie (4th ed.). Basel, Switzerland: Beltz. Andreassi, J. L. (2000). Psychophysiology: Human behaviour & physiological response. Mahwah, NJ, USA: Lawrence Erlbaum. 22\nPage 24: Psychophysiology: Electrodermal activity: Skin Eccrine sweat production Sweating appears to not purely serve thermoregulation. The eccrine glands in the hands and feet respond weakly to temperature, and more strongly to psychological stimuli. Possible evolutionary advantages: sweat aids grasping, protects against injury, and lowers body temperature. Andreassi, J. L. (2000). Psychophysiology: Human behaviour & physiological response. Mahwah, NJ, USA: Lawrence Erlbaum. 23\nPage 25: Psychophysiology The human skin The human skin consists of two layers, the outer epidermis, and the inner dermis. It aids or enables protection, sensation, and regulation. Eccrine sweat glands in the dermis are exclusively under sympathetic control, and respond to psychological stimuli. 24\nPage 26: Psychophysiology: Electrodermal activity Measuring EDA 25\nPage 27: Psychophysiology: Electrodermal activity: Measurement Conductance We will focus on conductance, as potential recordings are less common, and the mechanism still not fully explained. Conductivity C is the reciprocal of resistivity. Ohm’s law: Therefore: The conductivity unit siemens (S) is thus Ω-1, with electrical conductance additionally dependent on the surface of the electrode, finally using S/m as unit. For EDA, the scale is usually in µS. A traditional, non-SI unit that is otherwise equivalent to siemens is mho. 26 𝑅 = 𝑉 𝐼 𝐶 = 1 𝑅 = 𝐼 𝑉\nPage 28: Psychophysiology: Electrodermal activity: Measurement Electrode locations For skin conductance a bipolar, and for skin potential recordings a unipolar recording is preferred. The unipolar reference site should be made neutral, e.g. using a subdermal electrode. Bipolar recordings sites should be innervated from the same spinal nerve. 27 Bipolar recording Unipolar recording A R\nPage 29: Psychophysiology: Electrodermal activity: Measurement Recording conductance The non-dominant hand is often used as the corneum tends to be thinner. This hand should be washed beforehand, but not with soap. Alcohol may be used instead. Electrodes should be as big as practically feasible to increase signal quality. (For comparison and standardisation, measurements should be normalised with respect to this area.) Avoid artificially increasing the area by “leaking” gel. 28\nPage 30: Psychophysiology: Electrodermal activity: Measurement Artefacts • Temperature, humidity • Should be held constant; participant may need to acclimatize • Respiratory cycle, cardiac activity • May be recorded simultaneously • Mechanical, electrical, or thermal stimulation of the skin near the electrodes • Results in activity that is hard to distinguish from psychologically relevant activity 29\nPage 31: Psychophysiology: Electrodermal activity Analysis of EDA 30\nPage 32: Psychophysiology: Electrodermal activity: Analysis Tonic vs phasic changes In signal analysis, two types of activity are distinguished: • slow, tonic changes of ~2 – 100 µS/cm², and • faster, phasic changes of ~0.01 – 5 µS/cm². These are referred to as • skin conductance level (SPL) and • skin conductance response (SPR), respectively. Care needs to be taken of the differences in magnitude. 31\nPage 33: Psychophysiology: Electrodermal activity: Analysis Tonic vs phasic changes Winter, M., Pryss, R., Probst, T., & Reichert, M. (2020). Towards the applicability of measuring the electrodermal activity in the context of process model comprehension: Feasibility study. Sensors, 20(16). Figure is licensed under CC BY 4.0. 32\nPage 34: Psychophysiology: Electrodermal activity: Analysis Tonic parameters The SCL itself varies greatly between individuals. Interpreting it as “general arousal level” is therefore wrong. Within-subjects relative SCL difference however may be indicative of changes in arousal. A possibly more reliable measure of general arousal is the rate of non-specific fluctuations, e.g. per minute. A non-specific fluctuation is defined as occurring e.g. more than 5 seconds after any known stimulus, including artefactual ones (e.g. breathing-related events). 33\nPage 35: Psychophysiology: Electrodermal activity: Analysis Tonic versus phasic changes Leiner, D., Fahr, A., & Früh, H. (2012). EDA positive change: A simple algorithm for electrodermal activity to measure general audience arousal during media exposure. Communication Methods and Measures, 6(4), 237-250. 34\nPage 36: Psychophysiology: Electrodermal activity: Analysis Phasic parameters Winter, M., Pryss, R., Probst, T., & Reichert, M. (2020). Towards the applicability of measuring the electrodermal activity in the context of process model comprehension: Feasibility study. Sensors, 20(16). Figure is licensed under CC BY 4.0. 35\nPage 37: Psychophysiology: Electrodermal activity: Analysis Phasic parameters Leiner, D., Fahr, A., & Früh, H. (2012). EDA positive change: A simple algorithm for electrodermal activity to measure general audience arousal during media exposure. Communication Methods and Measures, 6(4), 237-250. 36\nPage 38: Psychophysiology: Electrodermal activity: Analysis Phasic parameters Leiner, D., Fahr, A., & Früh, H. (2012). EDA positive change: A simple algorithm for electrodermal activity to measure general audience arousal during media exposure. Communication Methods and Measures, 6(4), 237-250. 37\nPage 39: Psychophysiology: Electrodermal activity: Analysis Sample study: James Bond 007 Cover figure: © Eurocom Entertainment Software / Electronic Arts Ravaja, N., Turpeinen, M., Saari, T., Puttonen, S., & Keltikangas-Järvinen, L. (2008). The psychophysiology of James Bond: Phasic emotional responses to violent video game events. Emotion, 8(1), 114. 38\nPage 40: alence ( ) alence ( ) rousal ( ) rousal ( ) eutral Psychophysiology: Electrodermal activity: Analysis James Russell’s circumplex model of emotion Russell, J. A. (1980). A circumplex model of affect. Journal of Personality and Social Psychology, 39(6), 1161–1178. Figure by MrAnmol is licensed under CC BY-SA 4.0 39\nPage 41: Psychophysiology: Electrodermal activity: Analysis Sample study: James Bond 007 Ravaja, N., Turpeinen, M., Saari, T., Puttonen, S., & Keltikangas-Järvinen, L. (2008). The psychophysiology of James Bond: Phasic emotional responses to violent video game events. Emotion, 8(1), 114. 40\nPage 42: Psychophysiology Electrodermal activity The activity of eccrine sweat glands, particularly prevalent on palms and soles, has psychological correlates. This activity can be measured continuously as changes in skin conductance. Parameters of the event-related skin conductance response (SCR) are of primary interest for psychophysiological research. 41\nPage 43: * Psychophysiology Part 7: Electrodermal activity Dr. Laurens R. Krol krol@b-tu.de 42"
  },
  {
    "id": "psychophysiology-8-1-electrocortical-activity",
    "title": "Psychophysiology 8.1 Electrocortical Activity",
    "sourceFile": "Psychophysiology 8.1 Electrocortical activity.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 8.1: Electrocortical activity Dr. Laurens R. Krol Dr. Marius Klug\nPage 2: Psychophysiology: Electrocortical activity The electroencephalogram Figure by lrkrol is in the public domain 1\nPage 3: Psychophysiology Electrocortical activity Brief history of EEG Physiological origins EEG versus other modalities 2021-10-20 2\nPage 4: Psychophysiology: Electrocortical activity Brief history of EEG 2021-10-20 3\nPage 5: Psychophysiology: Electrocortical activity: History Physiological measurement Richard Caton used a galvanometer to observe electrical impulses from the surface of living rabbit and monkey brains. “… currents ... were found to be … influenced by stimulation of the ... retina by light.” Caton, R. (1875). The electric currents of the brain. British Medical Journal, 2(765), 278. Photo: “A moving coil galvanometer” by Wellcome Collection is licensed under CC BY 4.0 / Removed background from original 4\nPage 6: Psychophysiology: Electrocortical activity: History Physiological measurement On July 6th, 1924, Hans Berger performed the first measures on a living human brain. Later measurements, which Berger conducted on his own son, revealed first indications that different intensities of mental activity led to visible changes in the recorded curves. Berger, H. (1929). Über das Elektrenkephalogramm des Menschen. Archiv für Psychiatrie und Nervenkrankheiten, 87, 527–570. 5 EEG ECG 10 Hz\nPage 7: Psychophysiology: Electrocortical activity: History Electrocerebrogram? Berger, H. (1929). Über das Elektrenkephalogramm des Menschen. Archiv für Psychiatrie und Nervenkrankheiten, 87, 527–570. 6 “Ich glaube in der Tat, daß die von mir hier ausführlich geschilderte cerebrale Kurve im Gehirn entsteht und dem Elektrocerebrogramm der Säugetiere von Neminski entspricht. Da ich aus sprachlichen Gründen das Wort ‘Elektrocerebrogramm’, das sich aus griechischen und lateinischen Bestandteilen zusammensetzt, für barbarisch halte, möchte ich für diese von mir hier zum erstenmal beim Menschen nachgewiesene Kurve in Anlehnung an den Namen ‘Elektrokardiogramm’ den Namen ‘Elektrenkephalogramm’ vorschlagen.” – Berger (1929)\nPage 8: Psychophysiology: Electrocortical activity: History The electroencephalogram 7 = the “graphical” representation of the electrical activity of the brain (Greek: encephalon) Electroencephalography refers to the method. The abbreviation EEG can refer to either electroencephalogram or electroencephalography. Using EEG, brain activity is usually recorded at the scalp.\nPage 9: Psychophysiology: Electrocortical activity The electroencephalogram Figure by lrkrol is in the public domain 8\nPage 10: Psychophysiology: Electrocortical activity Recap: Electricity • Current The flow of charged particles through a conductor, measured in ampere (A). • Voltage The potential for current to flow from one place to another, measured in volt (V). • Resistance A substance’s ability to resist the flow of current, measured in ohm (Ω). Impedance is resistance for alternating currents. 9\nPage 11: Psychophysiology: Electrocortical activity Physiological origins 2021-10-20 10\nPage 12: Psychophysiology: Electrocortical activity: Physiology Recap: Postsynaptic potential Synapse figure by OpenStax is licensed under CC BY 4.0 11\nPage 13: Psychophysiology: Electrocortical activity: Physiology Recap: Action potential Figure by OpenStax is licensed under CC BY 4.0 12\nPage 14: Psychophysiology: Electrocortical activity: Physiology Microelectrodes versus scalp measures Figure: “Pyramidal hippocampal neuron 40x” by MethoxyRoxy is licensed under CC BY-SA 2.5 / Added electrode 13\nPage 15: Psychophysiology: Electrocortical activity: Physiology Barriers between brain and scalp electrodes “Blausen 0110 BrainLayers” by Bruce Blaus is licensed under CC BY 3.0 / Some colour adjustments Blausen.com staff (2014). \"Medical gallery of Blausen Medical 2014\". WikiJournal of Medicine 1(2). 14\nPage 16: Psychophysiology: Electrocortical activity: Physiology Barriers between brain and scalp electrodes 15 Not only are there barriers between the electrical activity of the neuron and the scalp electrode, they are also just far away. Therefore, synchronous activity of larger cell populations is needed for a large enough electrical effect to be measurable at the scalp. In fact, both temporal synchrony and an appropriate spatial organisation is required for this.\nPage 17: Psychophysiology: Electrocortical activity: Physiology Electrical interference Synchronous, equally oriented currents add up. Figure: “VFPt charges plus minus thumb” and “VFPt charges plus minus” by Geek3 are licensed under CC BY-SA 3.0 16 + ≈\nPage 18: Psychophysiology: Electrocortical activity: Physiology Electrical interference Differently oriented currents may cancel out. Figure: “VFPt charges plus minus thumb” by Geek3 is licensed under CC BY-SA 3.0 17 0 0 + ≈\nPage 19: Psychophysiology: Electrocortical activity: Physiology Neuronal electrical activity in the EEG 18 In almost all cases, action potentials are too fast (1-2 ms) to be synchronous over large populations. Postsynaptic potentials last longer (10-250 ms), allowing their synchronous activity to summate to be measurable at the scalp. Aside from temporal synchrony, this requires a physical arrangement of the neurons that does not cancel out the synchronous electric fields. This is the case for the pyramidal cells in the cerebral cortex.\nPage 20: Psychophysiology: Electrocortical activity: Physiology Cortical pyramidal cells Figure by Fabuio is licensed under CC BY 4.0 / Removed collateral axon Photo: “GolgiStainedPyramidalCell” by Bob Jacobs is licensed under CC BY-SA 3.0 19 Soma Apical dendrites Basal dendrites Axon\nPage 21: Psychophysiology: Electrocortical activity: Physiology Cortical pyramidal cells 20 + + + + + –\nPage 22: Psychophysiology: Electrocortical activity: Physiology Cortical pyramidal cells Figure: “VFPt charges plus minus thumb” by Geek3 is licensed under CC BY-SA 3.0 21 Cortical surface\nPage 23: Psychophysiology: Electrocortical activity: Physiology Physiological origins of EEG A single EEG electrode records the activity of at least 10 million neurons, possibly up to 1000 million. EEG, therefore, has relatively low spatial resolution. This is due to the previous requirements, as well as volume conduction. Numbers from Nunez, P. L., & Srinivasan, R. (2006). Electric fields of the brain: the neurophysics of EEG. New York, NY, USA: Oxford University Press. 22\nPage 24: Psychophysiology: Electrocortical activity: Physiology Volume conduction Through volume conduction, the spread of the electric (voltage) fields is instantaneous and reaches the scalp surface everywhere at once. (Remember: No neutral reference.) The dipolar nature of the activity means that for any dipole, both positive and negative voltage changes arrive simultaneously on different areas at the scalp. 23\nPage 25: Psychophysiology: Electrocortical activity: Physiology Volume conduction 24\nPage 26: Psychophysiology: Electrocortical activity: Physiology Physiological origins of EEG EEG is thought to originate from - the synchronous activity - of postsynaptic potentials - at the apical dendrites - of large populations - of pyramidal cells - in the cortical surface. 25\nPage 27: Psychophysiology: Electrocortical activity: Physiology The electroencephalogram 26\nPage 28: Psychophysiology: Electrocortical activity EEG versus other modalities 27\nPage 29: Psychophysiology: Electrocortical activity: Comparison Electroencephalography (EEG) Advantages: - High temporal resolution - Relatively inexpensive - Noninvasive - Mobile Disadvantages: - Low spatial resolution - No activity from deeper brain structures - Complex signal that can interfere with itself 28\nPage 30: Psychophysiology: Electrocortical activity: Comparison Magnetoencephalography (MEG) MEG records brain activity by measuring the magnetic fields produced by electrical currents in the brain. MEG signals originate from the same physiological processes as EEG signals. Photo is in the public domain 29\nPage 31: Psychophysiology: Electrocortical activity: Comparison Magnetoencephalography (MEG) Advantages: - High temporal resolution - Better spatial resolution because the skull and scalp are transparent to magnetism - Noninvasive - Reference-free Disadvantages: - No activity from deeper brain structures - Expensive - Stationary 30\nPage 32: Psychophysiology: Electrocortical activity: Comparison Functional Magnetic Resonance Imaging (fMRI) fMRI indirectly records brain activity by detecting changes in blood oxygenation levels using magnetic fields. Neural activity requires energy, resulting in an increase in oxygen in the blood near active neural tissue. “MRI-Philips” by Jan Ainali is licensed under CC BY 3.0 / Cropped from original 31\nPage 33: Psychophysiology: Electrocortical activity: Comparison Functional Magnetic Resonance Imaging (fMRI) Advantages - High spatial resolution - Can reach deeper brain structures - Noninvasive 32 Disadvantages - Low temporal resolution - Expensive - Stationary (lying down)\nPage 34: Psychophysiology: Electrocortical activity: Comparison Functional Near-Infrared Spectroscopy (fNIRS) fNIRS indirectly records brain activity by detecting changes in blood oxygenation levels. The reflection of near- infrared light, rather than magnetic fields, is used to detect this. Photo by Elisenicolegray is licensed under CC BY-SA 4.0 / Cropped from original 33\nPage 35: Psychophysiology: Electrocortical activity: Comparison Functional Near-Infrared Spectroscopy (fNIRS) Advantages - Clear spatial localisation of activity - Relatively inexpensive - Noninvasive - Mobile 34 Disadvantages - Low temporal resolution - Low spatial resolution\nPage 36: Psychophysiology: Electrocortical activity: Comparison Electrocorticography (ECoG) ECoG measures the electrical activity from the cerebral cortex with electrodes placed directly on the cortical surface. “Intracranial electrode grid for electrocorticography” by Bruce Blaus is licensed under CC BY 3.0 Blausen.com staff (2014). \"Medical gallery of Blausen Medical 2014\". WikiJournal of Medicine 1(2). 35\nPage 37: Psychophysiology: Electrocortical activity: Comparison Electrocorticography (ECoG) Advantages - High temporal resolution - High spatial resolution - High signal-to-noise ratio 36 Disadvantages - Highly invasive: requires surgery - Usually limited to select areas of the brain\nPage 38: * Psychophysiology Part 8.1: Electrocortical activity Dr. Laurens R. Krol krol@b-tu.de 37"
  },
  {
    "id": "psychophysiology-8-2-electrocortical-measures",
    "title": "Psychophysiology 8.2 Electrocortical Measures",
    "sourceFile": "Psychophysiology 8.2 Electrocortical measures.pdf",
    "text": "Page 1: Foundations of Psychophysiology Part 8.2: Electrocortical measures Dr. Laurens R. Krol Dr. Marius Klug\nPage 2: Psychophysiology: Electrocortical measures The electroencephalogram Figure by lrkrol is in the public domain 1\nPage 3: Psychophysiology Electrocortical measures Recording an EEG Spontaneous EEG activity Frequency domain analysis Time domain analysis Time-frequency analysis Time-time analysis 2021-10-20 2\nPage 4: Psychophysiology: Electrocortical measures Recording an EEG 2021-10-20 3\nPage 5: Psychophysiology: Electrocortical measures: Recording Electrodes 4 Active electrode Reference electrode Voltage\nPage 6: Psychophysiology: Electrocortical measures: Recording The reference electrode “Active” electrodes are placed near “electrically active” regions to measure voltage relative to an “electrically neutral” reference (or ground) electrode. However, there is no “electrically neutral” reference location on the human body. Use a reference location that has a good connection. Use a single reference for all electrodes. Use a reference location that is common practice for the experiment you’re conducting. 5\nPage 7: Psychophysiology: Electrocortical measures: Recording Reproducing electrode positions Figure by Avard T. Fairbanks is licensed under CC BY-SA 4.0 (as per the executor of his estate, Eugene F. Fairbanks) 6\nPage 8: Psychophysiology: Electrocortical measures: Recording The international 10-20 system Fiducials - Nasion - Pre-auricular points (left and right) - Inion 7\nPage 9: Psychophysiology: Electrocortical measures: Recording The international 10-20 system 8 50% 50% 50% 50% 20% 10% 20% 10% 10% 10% 10% 10%\nPage 10: Psychophysiology: Electrocortical measures: Recording The international 10-20 system Figure by lrkrol is in the public domain 9 F – Frontal C – Central P – Parietal O – Occipital T - Temporal Odd – Left z – Midline Even – Right\nPage 11: Psychophysiology: Electrocortical measures: Recording Standardised caps Photo: © Brain Products GmbH 10 Fitted electrode caps make sure that the relative electrode positions are correct. We have to make sure the cap is placed correctly! Use the correct cap size, and place Cz on the centre of the head.\nPage 12: Psychophysiology: Electrocortical measures: Recording Applying electrodes To reduce impedance between the skin and the electrode and to make the connection more stable, - the sites can be cleaned with alcohol, and/or - the outer layer of dead skin cells can be abraded. Also, - a conducing electrolyte gel is used. The electrolyte diffuses into the skin over time, bridging over the outer layer. It also provides stability against mechanical movement. 11\nPage 13: Psychophysiology: Electrocortical measures: Recording Amplifier settings For EEG, frequencies above 100 Hz are not commonly investigated. Following Nyquist, we may thus sample at 200 Hz. To avoid aliasing, however, we generally record at five to ten times the highest frequency of interest, with a low-pass filter at half the sampling rate. For a highest frequency of interest at 100 Hz, we may thus sample at 1000 Hz with a low-pass filter at 500 Hz. 12\nPage 14: Psychophysiology: Electrocortical measures: Recording Artefacts Aside from the general artefacts already discussed, e.g. - environmental artefacts, - mechanical artefacts, - skin potentials, and - muscle activity (face, neck, jaw), eye movements are a prominent source of artefacts in EEG recordings. 13\nPage 15: Psychophysiology: Electrocortical measures: Recording Eye movements Original eye figure by ZStardust is in the public domain 14 + ++ ++– – –– – + – → t mV ↑ + – → t mV ↑ + – → t mV ↑\nPage 16: Psychophysiology: Electrocortical measures: Recording Eye movements During horizontal eye movements, the corneo- retinal dipole induces potential changes across the scalp. Eye blinks, due to the eyelid “closing” the cornea-scalp circuit, similarly affect EEG recordings. 15 Horizontal movement Blinks\nPage 17: Psychophysiology: Electrocortical measures Spontaneous EEG activity 16\nPage 18: Psychophysiology: Electrocortical measures The electroencephalogram 17\nPage 19: Psychophysiology: Electrocortical measures Spontaneous EEG activity “Spontaneous” brain activity refers to continuous ongoing brain activity that is present even in the absence of any discrete stimuli. Essentially, our brains are always active: a living person’s EEG is never silent. Different frequencies can be dissociated in this spontaneous EEG activity. 18\nPage 20: Psychophysiology: Electrocortical measures Spontaneous EEG activity Figure by lrkrol is in the public domain 19\nPage 21: Psychophysiology: Electrocortical measures: Spontaneous activity Delta rhythm (1-4 Hz) - Associated with phases of deep sleep, which are therefore also known as “slow-wave sleep” phases - Associated with (induces) the release of a number of hormones - No known cognitive or affective correlates 20\nPage 22: Psychophysiology: Electrocortical measures: Spontaneous activity Theta rhythm (4-8 Hz) - Associated with transition phases from asleep to awake - Associated with increased cognitive strain - Associated with the processing of new information - (Also associated with activity in the hippocampus, but this has little bearing on scalp EEG) 21\nPage 23: Psychophysiology: Electrocortical measures: Spontaneous activity Alpha rhythm (8-12 Hz) - Dominant regular frequency in human EEG (aside from bursts of delta activity) - Most prominent during wakeful relaxation with closed eyes, primarily over occipital sites - Alpha desynchronization (reduced alpha activity) is associated with attention and cognitive work, especially in combination with simultaneous theta synchronization (increased activity) 22\nPage 24: Psychophysiology: Electrocortical measures: Spontaneous activity Mu (sensorimotor) rhythm (8-13 Hz) - Similar to alpha, but distinguished from the alpha rhythm by location: the mu rhythm is associated with the motor cortex - Mostly observed when no motor actions are performed 23\nPage 25: Psychophysiology: Electrocortical measures: Spontaneous activity Beta rhythm (12-30 Hz) - Associated with mental and physical activity - Often split into lower/higher ranges, e.g. at 20 Hz 24\nPage 26: Psychophysiology: Electrocortical measures: Spontaneous activity Gamma rhythm (30+ Hz) - Associated with attention and sensory processing - Associated with integration and association of information across distributed networks - “Prototypical” gamma is 40 Hz 25\nPage 27: Psychophysiology: Electrocortical measures: Spontaneous activity Neural oscillations The oscillatory nature of these various rhythms may reflect feedback loops in the brain, e.g. time-delayed connections between excitatory and inhibitory neurons. Peak frequencies vary across persons. Frequency band definitions are largely historical and vary from field to field, time to time, expert to expert. It is a gross simplification to simply equate activity of any frequency with any particular function. At the very least, take into account where in the brain the activity occurs, and in what context. 26\nPage 28: Psychophysiology: Electrocortical measures: Spontaneous activity EEG contains activity of all frequencies All frequency bands are always represented in EEG. More generally, in fact, any signal can be decomposed into mixtures of different frequencies. (With EEG, some bands just have names.) 27\nPage 29: Psychophysiology: Electrocortical measures Frequency domain analysis 28\nPage 30: Psychophysiology: Electrocortical measures: Spectral Power spectrum One way to analyse EEG is to look at its power spectrum, representing the power in all the different frequencies contributing to the recorded signal. 29\nPage 31: Psychophysiology: Electrocortical measures: Spectral Example experiment: Mu-band desynchronisation In different conditions, participants are asked to a) rest, or b) grasp an object and repeat this multiple times with pauses in between. Muthukumaraswamy, S. D., Johnson, B. W., & McNair, N. A. (2004). Mu rhythm modulation during observation of an object-directed grasp. Cognitive Brain Research, 19(2), 195–201. 30 Grasp … Grasp … … 7 s 7 s\nPage 32: Psychophysiology: Electrocortical measures: Spectral Example experiment: Mu-band desynchronisation Comparing power in the mu band over the motor cortex between conditions, we see: Muthukumaraswamy, S. D., Johnson, B. W., & McNair, N. A. (2004). Mu rhythm modulation during observation of an object-directed grasp. Cognitive Brain Research, 19(2), 195–201. 31\nPage 33: Psychophysiology: Electrocortical measures: Spectral Example experiment: Mu-band desynchronisation The actual experiment had five conditions: a) rest; b) observe someone move their hand in a flat position; c) observe someone move their hand in a grasping motion; d) observe someone move their hand to grasp an object; e) grasp an object themselves. Muthukumaraswamy, S. D., Johnson, B. W., & McNair, N. A. (2004). Mu rhythm modulation during observation of an object-directed grasp. Cognitive Brain Research, 19(2), 195–201. 32\nPage 34: Psychophysiology: Electrocortical measures: Spectral Example experiment: Mu-band desynchronisation Muthukumaraswamy, S. D., Johnson, B. W., & McNair, N. A. (2004). Mu rhythm modulation during observation of an object-directed grasp. Cognitive Brain Research, 19(2), 195–201. 33\nPage 35: Psychophysiology: Electrocortical measures: Spectral Example experiment: Mu-band desynchronisation The mu rhythm responded to both observed and executed movements. Muthukumaraswamy, S. D., Johnson, B. W., & McNair, N. A. (2004). Mu rhythm modulation during observation of an object-directed grasp. Cognitive Brain Research, 19(2), 195–201. 34\nPage 36: Psychophysiology: Electrocortical measures: Spectral Example experiment: Motor imagery The mu rhythm also responds to imagined movements. Motor imagery experiments generally ask participants to perform different kinds of imagined movement, e.g. different hands, feet, … Maeder, C. L., Sannelli, C., Haufe, S., & Blankertz, B. (2012). Pre-stimulus sensorimotor rhythms influence brain–computer interface classification performance. IEEE Transactions on Neural Systems and Rehabilitation Engineering, 20(5), 653–662. 35 + Left-hand movement + 2 s 4 s 2 s 2 s Right-hand movement … 4 s\nPage 37: Psychophysiology: Electrocortical measures: Spectral Example experiment: Motor imagery Different kinds of imagined movements produce different spatiospectral patterns in the EEG. Maeder, C. L., Sannelli, C., Haufe, S., & Blankertz, B. (2012). Pre-stimulus sensorimotor rhythms influence brain–computer interface classification performance. IEEE Transactions on Neural Systems and Rehabilitation Engineering, 20(5), 653–662. 36\nPage 38: Psychophysiology: Electrocortical measures: Spectral Example experiment: Motor imagery Figure by OpenStax is licensed under CC BY 4.0 37 The motor cortex is organised as a topographic map of the body. This organisation is contralateral.\nPage 39: Psychophysiology: Electrocortical measures: Spectral Example experiment: Workload Participants are asked to a) rest b) perform a mentally straining task (e.g. arithmetic) for a few seconds each, and then repeat. 38 23 x 19 = ? Rest 16 x 13 = ? Rest … 10 s 10 s 10 s 10 s\nPage 40: Psychophysiology: Electrocortical measures: Spectral Example experiment: Workload Workload is commonly found to produce a parietal decrease in alpha-band activity with a simultaneous frontal increase in theta-band activity. Figure: Gevins, A., & Smith, M. E. (2003). Neurophysiological measures of cognitive workload during human-computer interaction. Theoretical Issues in Ergonomics Science, 4(1–2), 113–131. 39\nPage 41: Psychophysiology: Electrocortical measures Frequency domain analysis Comparing EEG activity between different conditions, we can find differences in the spectral power of different frequency bands. We can look at multiple frequency bands at the same time, as well the spatial patterns of different frequency bands, to obtain more specific results. As such, we can for example differentiate between different types of imagined movement, and phases of high and low mental load. 40\nPage 42: Psychophysiology: Electrocortical measures Time domain analysis 41\nPage 43: Psychophysiology: Electrocortical measures Event-related analysis 42 Participant saw something they liked Participant noticed they made a mistake Participant stubbed their toe Rather than brain activity generalized across conditions, can we detect changes in brain activity in response to specific events?\nPage 44: Psychophysiology: Electrocortical measures: Temporal The event-related potential (ERP) 43 A segment of EEG activity investigated relative to a specific event is called an event-related potential. Participant saw something they liked Participant noticed they made a mistake Participant stubbed their toe\nPage 45: Psychophysiology: Electrocortical measures: Temporal Epoching and ERP averaging 44 Looking at one such ERP, you will probably find nothing. This is because there is too much other (brain) activity going on that is not related to the event.\nPage 46: Psychophysiology: Electrocortical measures: Temporal Epoching and ERP averaging 45 Epoching is the practice of extracting all time segments relative to specific events from an EEG recording. When you take the average ERP across multiple epochs, activity that does not systematically vary relative to the event and a specific baseline is averaged out.\nPage 47: Psychophysiology: Electrocortical measures: Temporal ERP components Figure “ComponentsofERP” by Mononomic is licensed under CC BY-SA 3.0 46\nPage 48: Psychophysiology: Electrocortical measures: Temporal Example experiment: Word semantics Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 47 Participants are shown one word. The next word is either a) related to the first word, or b) unrelated to the first word. This is repeated for many word pairs. SALT + PEPPER + … 200 ms 900-1100 ms 200 ms 1400-1600 ms\nPage 49: Psychophysiology: Electrocortical measures: Temporal Example experiment: Word semantics Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 48 Comparing the event-related potential for relevant and non-relevant words, we see:\nPage 50: Psychophysiology: Electrocortical measures: Temporal Difference wave Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 49 To focus on the differences between conditions, subtract one ERP’s amplitude from the other’s at each time sample.\nPage 51: Psychophysiology: Electrocortical measures: Temporal Spatial analysis of ERPs Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 50 By topographically mapping each channel’s ERP amplitude, it can also be analysed spatially. Mean amplitude between 300 and 500 ms for: Related words Unrelated words Difference\nPage 52: Psychophysiology: Electrocortical measures: Temporal Example experiment: Flanker test Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 51 Participants are shown a string of “<”s and “>”s. As quickly as possible, they have to indicate what direction the middle character is pointing. The surrounding “flankers” either a) point in the same direction (congruent: easy), or b) point in the other direction (incongruent: confusing). >>>>> + >><>> + … 200 ms 1200-1400 ms 200 ms 1200-1400 ms\nPage 53: Psychophysiology: Electrocortical measures: Temporal Example experiment: Flanker test Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 52 Comparing the event-related potential following correct versus incorrect responses, we see:\nPage 54: Psychophysiology: Electrocortical measures: Temporal Example experiment: Flanker test Data from: Kappenman, E. S., Farrens, J. L., Zhang, W., Stewart, A. X., & Luck, S. J. (2021). ERP CORE: An open resource for human event-related potential research. NeuroImage, 225, 117465. 53 The differential activity projects primarily onto frontal sites. Mean amplitude between 0 and 100 ms for: Correct responses Incorrect responses Difference\nPage 55: Psychophysiology: Electrocortical measures Time domain analysis The main time domain analysis method is the event-related potential technique. Multiple instances of brain activity relative to the same event are averaged together. This leaves systematic event-related changes, while averaging out irrelevant noise. Comparing ERPs across conditions, detailed differences can be found. 54\nPage 56: Psychophysiology: Electrocortical measures Time-frequency analysis 55\nPage 57: Psychophysiology: Electrocortical measures Time-frequency analysis Estimates of band power can also be calculated for smaller periods of time, e.g. using wavelet transform. This allows spectral properties to be analysed over time. 56\nPage 58: Psychophysiology: Electrocortical measures: Spectrotemporal Example experiment: Go/NoGo button press Participants attended to one coloured square out of five. They pressed a button when a stimulus appeared in the attended square. Figure “press button” by Hea Poh Lin is licensed under CC BY 3.0 via Noun Project Makeig, S., Delorme, A., Westerfield, M., Jung, T.-P., Townsend, J., Courchesne, E., & Sejnowski, T. J. (2004). Electroencephalographic brain dynamics following manually responded visual targets. PLOS Biology, 2(6), 0747–0762. 57 + + + … 250-1000 ms 117 ms 250-1000 ms If target\nPage 59: Psychophysiology: Electrocortical measures: Spectrotemporal Event-related spectral perturbation (ERSP) The ERSP shows the changes in power relative to a baseline time-locked to the manual response. Makeig, S., Delorme, A., Westerfield, M., Jung, T.-P., Townsend, J., Courchesne, E., & Sejnowski, T. J. (2004). Electroencephalographic brain dynamics following manually responded visual targets. PLOS Biology, 2(6), 0747–0762. Note: IC-level result, not channel-level. 58\nPage 60: Psychophysiology: Electrocortical measures Time-time analysis 59\nPage 61: Psychophysiology: Electrocortical measures Time-time analysis The event-related potential is often investigated as an average across many trials. The ERP image shows multiple single-trial ERPs across time. First, the single-trial ERP amplitudes are colour- coded. Makeig, S., & Onton, J. A. (2011). ERP features and EEG dynamics: An ICA perspective. In S. J. Luck & E. S. Kappenman (Eds.), The Oxford handbook of event-related potential components (pp. 51–107). New York, NY: Oxford University Press. 60\nPage 62: Psychophysiology: Electrocortical measures: Temporotemporal Time-time analysis Stacking multiple colour-coded single-trial ERPs creates an ERP image. Makeig, S., & Onton, J. A. (2011). ERP features and EEG dynamics: An ICA perspective. In S. J. Luck & E. S. Kappenman (Eds.), The Oxford handbook of event-related potential components (pp. 51–107). New York, NY: Oxford University Press. 61\nPage 63: Psychophysiology: Electrocortical measures: Temporotemporal Time-time analysis By vertically re-sorting the trials, here by reaction time, different ERP effects become clearly visible. Makeig, S., & Onton, J. A. (2011). ERP features and EEG dynamics: An ICA perspective. In S. J. Luck & E. S. Kappenman (Eds.), The Oxford handbook of event-related potential components (pp. 51–107). New York, NY: Oxford University Press. 62\nPage 64: Psychophysiology Electrocortical measures The three spectral, temporal, and spatial domains—and combinations thereof—are all relevant to the analysis of EEG activity. Analysis can be performed between conditions, or relative to specific events. Averages of many trials cancel out noise. To compare different conditions or events, one is often subtracted from the other. 63\nPage 65: * Psychophysiology Part 8.2: Electrocortical measures Dr. Laurens R. Krol krol@b-tu.de 64"
  }
]